{"TEXT1": "SPOILER: The young lover, Jed, is kicked out by the spinster, Kate (Andie McDowell), because she wrongly believes that Jed is having an affair with one of her two catty girlfriends. Kate thought she caught them en flagrante delicto. Kate throws Jed's shoes out the door. Jed reluctantly leaves, and then sits in the middle of the road to put his shoes on. Then he gets run over (\"Crushed\", one of the meaning of the title) by a truck. And dies.<br /><br />\"And then he gets run over by a truck.\" Can you imagine a screenwriter actually submitting a script with this plot element? Up to then, its a comedy that intends to be frothy, but lacks any real fizz. Everybody but Jed is just annoying. And then they kill Jed, and everybody's sad, until the end where the gals learn to love one another and be supportive, instead of destructive. I give it 2 ugh's.", "LBL": "negative"}
{"TEXT1": "The worst thing about Crush is not that it's acted pretty bad, or that the plot is virtually non-existent, and it's not even that bad that the camerawork could have been better.<br /><br />No, the worst part of this movie is that it has a few absolutely brilliant moments that keep you hoping that there are more to come.<br /><br />But in the end, it's too little, too late. If you are a fan of violin-music and cheap tearjerking scenes of 40+ women crying and hugging and talking about babies and marriage - then by all means, don't miss it.<br /><br />I myself am not exactly thrilled to see the things listed above in a movie, and as a result I had a pretty horrible time. The few absolutely brilliant jokes can not make up for the rest of it.<br /><br />The verdict: 4/10. Guilty of wasting my time.<br /><br />", "LBL": "negative"}
{"TEXT1": "Not a `woman film' but film for the gang. One of the worst films ever made by a male director about woman. Director Andy McKay simply doesn't know woman. Peaks of bad taste, American Pie's humor style, crude story, no sense, groundless story, refuted characters. Vulgar fantasies came to life on screen. Insulting and definitely not funny. I wonder how three good actresses accepted to take part in it.", "LBL": "negative"}
{"TEXT1": "As a single woman over 40, I found this film extremely insulting and demeaning to single women over 40, not to mention every other woman, of any age. It was a sad, pathetic attempt by a man to write and direct a \"chick flick\", and it failed miserably. Andy McDowell isn't much of an actress to begin with, but given the non-existent \"plot\" (I hate to even refer to it as a plot) in this, she didn't have a chance. There was no character development, no reason to feel sympathy/empathy for any of the characters, and no attempt to make the film in any way realistic or believable. And then there's the obligatory male-fantasy of an attractive straight woman suddenly deciding to give lesbianism a try -- PLEASE.<br /><br />Not only do I wish I could get my money back for the DVD rental, I also want those 112 minutes of my life back. What a ripoff.", "LBL": "negative"}
{"TEXT1": "I was gifted with this movie as it had such a great premise, the friendship of three women bespoiled by one falling in love with a younger man.<br /><br />Intriguing.<br /><br />NOT! I hasten to add. These women are all drawn in extreme caricature, not very supportive of one another and conspiring and contriving to bring each other down.<br /><br />Anna Chancellor and Imelda Staunton could do no wrong in my book prior to seeing this, but here they are handed a dismal script and told to balance the action between slapstick and screwball, which doesn't work too well when the women are all well known professionals in a very small town.<br /><br />And for intelligent women they spend a whole pile of time bemoaning the lack of men/sex/lust in their lives. I felt much more could have been made of it given a decent script and more tension, the lesbian sub-plot went nowhere and those smoking/drinking women (all 3 in their forties???) were very unrealistic - even in the baby scene - screw the baby, gimme a cigarette! Right.<br /><br />Like I said, a shame of a waste. 4 out of 10.", "LBL": "negative"}
{"TEXT1": "\"The Crush\" is a pleasant enough 40-something friends romantic chick flick for the first two-thirds or so, as it tries to be a Brit \"Sex and the City\". <br /><br />I particularly enjoyed the turn-around of the trophy young hunk whose character is not much fleshed out (come to think of it we didn't see all that much physical flesh of him either and Kenny Doughty is worth seeing more of). <br /><br />They sure make a lot more deal of young man/older woman than was made of the opposite in either version of \"Sabrina\" (neither movie do I like) or for that matter with the Douglas/Zeta-Jones or Dion/Svengali nuptials.<br /><br />Surrounding Andie MacDowell as an ex pat otherwise are welcome familiars from Brit dramas and comedies, such as tart-tongued Anna Chancellor. <br /><br />The plot twists towards the end feel very deus ex machina. But it wasn't until the credits came up at the end that I realized what might really be wrong. Just as with \"Sex and the City,\" the writer/director is male, here first-timer Scot John McKay, and I think he really wanted to do a script about three gay men, probably about them coming out in relation to their lovers and at work (the characters are a school principal, a cop and a doctor), which would have been a better and more interesting movie. The working title for the film was \"The Sad F*cker's Club\" which would have made its parallels with the gay \"Broken Hearts Club\" even more obvious.<br /><br />(originally written 4/6/2002)", "LBL": "negative"}
{"TEXT1": "it MIGHT have been a good movie if it had explored something more interesting rather than just the surface of a lesbian relationship if this was the meaning of the movie...it is quite predictable not mentioning that the two girls resemble the Russian group t.A.T.u....coincidence? i don't think so. There is nothing original in this movie to support it so they had to use something which is already famous.You know the recipe. The other actors...well,i just don't know what their role is supposed to be. Most of them are well - known people in Romania and i must mention some of them are not even actors(e.g.Mihaela Radulescu).SO to summarize it: \"girl band tatty\"+desperate/publicity needing \"actors\"+ a non-existing plot+ the occasion to use bad language in order to shock= Love sick....too bad...the idea was good,though...and i am seriously holding myself from commenting the title...", "LBL": "negative"}
{"TEXT1": "***LIGHT SPOILER ALERT*** The story sounds good and if you've read the novel, then you're probably expecting a deep and intense movie that could offer some insight for some interesting and insufficiently explored human relationships.<br /><br />True enough, the script tries to do that, the director tries to do that, but the main cast fails miserably. Maria's acting is so dry that lacks any feeling whatsoever, her most intense moments seem almost comical. Sometimes she seems to be nervous due to the camera. Her only really feeling scene is near the end where she gets dumped by her girlfriend.<br /><br />Ioana seems even more tense than Maria and even worse, she doesn't seem natural at all. Maria had the attitude, even if it was artificially pushed towards being obvious, but she had it and her character received some credibility. And to make matters worse, we don't have an insight on her: where does she come from, how come she got involved in the lesbian relationship, how did the relationship evolve? We only get some bits from her parents and their relationship just seems to 'be' there: it has a content and and end, but no beginning. Just like her partner Maria, she has only once scene that is truly touching, the scene where she dumps Maria's character Kiki.<br /><br />Tudor is the only person in this movie (aside from the landlady, great acting there) who manages to prove some acting talent. He has his character's attitude and it fits him. Only once or twice he seems to falter (the scene at his parents' meal, he tries to be obvious when it wasn't necessary at all).<br /><br />I love the story, Tudor Chirila is OK there, the landlady actually acts and Puya delivers his couple of lines with style, but this doesn't save the movie. Too bad, the entire setting had huge potential and the Romanian cinematography could've used a movie on this theme.<br /><br />Oddly enough, the incestuous relationship between brother and sister seems to have more credibility than the no-background no-feeling (well, Maria's spoken interludes are a nice try in this direction) lesbian relationship of Maria and Ioana. I'm quite sorry for spending money on a ticket, I'd rather had watched it from the comfort of my room.", "LBL": "negative"}
{"TEXT1": "This is a movie that relies solely on the somewhat controversial image of incest and lesbianism to get noticed.That is it.The dialogs are pathetic and the sensuality of the \"sex scenes\" is absolutely absent.The acting and the dialog are more suited for high-school children,yet the subject is intended for adult audiences. It is a gutless and shallow movie.It could have been way better if it had a story and more drama. Ah and on top of that, one more thing: why are inner monologues so excessively used? Makes it seem so cheap.All in all an embarrassing movie for Romanian cinema as well as for mature audiences attempting to view it.I know the means are scarce but, that is not always an excuse for a movie flopping as this one does.And please start using some good actors in your movies and stop recycling them from musicians (Tudor Chirila) - they can't act!", "LBL": "negative"}
{"TEXT1": "I am not so much like Love Sick as I image. Finally the film express sexual relationship of Alex, kik, Sandu their triangle love were full of intenseness, frustration and jealous, at last, Alex waked up and realized that they would not have result and future.Ending up was sad.<br /><br />The director Tudor Giurgiu was in AMC theatre on Sunday 12:00PM on 08/10/06, with us watched the movie together. After the movie he told the audiences that the purposed to create this film which was to express the sexual relationships of Romanian were kind of complicate.<br /><br />On my point of view sexual life is always complicated in everywhere, I don't feel any particular impression and effect from the movie. The love proceeding of Alex and Kiki, and Kiki and her brother Sandu were kind of next door neighborhood story.<br /><br />The two main reasons I don't like this movie are, firstly, the film didn't told us how they started to fall in love? Sounds like after Alex moved into the building which Kiki was living, then two girls are fall in love. It doesn't make sense at all. How a girl would fall in love with another girl instead of a man. Too much fragments, you need to image and connect those stories by your mind. Secondly, The whole film didn't have a scene of Alex and Kik's sexual intercourse, that 's what I was waiting for\u0085\u0085. However, it still had some parts were deserved to recommend. The \"ear piercing \" part was kind of interesting. Alex was willing to suffer the pain of ear piercing to appreciate kik's love. That was a touching scene which gave you a little idea of their love. Also, the scene of they were lying in the soccer field, the conversation express their loves were truthful and passionate.", "LBL": "negative"}
{"TEXT1": "I am not so much like Love Sick as I image. Finally the film express sexual relationship of Alex, kik, Sandu their triangle love were full of intenseness, frustration and jealous, at last, Alex waked up and realized that they would not have result and future.Ending up was sad.<br /><br />The director Tudor Giurgiu was in AMC theatre on Sunday 12:00PM on 08/10/06, with us watched the movie together. After the movie he told the audiences that the purposed to create this film which was to express the sexual relationships of Romanian were kind of complicate.<br /><br />On my point of view sexual life is always complicated in everywhere, I don't feel any particular impression and effect from the movie. The love proceeding of Alex and Kiki, and Kiki and her brother Sandu were kind of next door neighborhood story.<br /><br />The two main reasons I don't like this movie are, firstly, the film didn't told us how they started to fall in love? Sounds like after Alex moved into the building which Kiki was living, then two girls are fall in love. It doesn't make sense at all. How a girl would fall in love with another girl instead of a man. Too much fragments, you need to image and connect those stories by your mind. Secondly, The whole film didn't have a scene of Alex and Kik's sexual intercourse, that 's what I was waiting for\u0085\u0085. However, it still had some parts were deserved to recommend. The \"ear piercing \" part was kind of interesting. Alex was willing to suffer the pain of ear piercing to appreciate kik's love. That was a touching scene which gave you a little idea of their love. Also, the scene of they were lying in the soccer field, the conversation express their loves were truthful and passionate.", "LBL": "negative"}
{"TEXT1": "Considering that this movie had a serious and quite successful launching campaign, I would have expected something to be worth the fuzz...from the opening scene on (in which the two brothers \"sensually\" caress each other, laying naked in a bed) it goes rapidly downwards...nothing to get the attention, not a mind-catching thing in the whole plot, baaad baad acting (a few minor exceptions, but artificiality is at its best). Incest and lesbianism are promising themes, but the script analyses none of the two in depth ( mind that a possible excuse of the makers, saying that they aimed for a subtle movie would be hilarious, unless subtle and superficial mean the same thing...). The too curious viewers will not get any interesting scene...at this point, that could have saved some of the movie...so you can imagine how bad it is. Many other things could be said...but please watch the movie yourselves...I am an egoist and I would like as many people as possible to waste about 1 1/2h of their lives...like I did :(", "LBL": "negative"}
{"TEXT1": "Yes, indeed, it could have been a good movie. A love biangle, (sorry for the poetical license, but is not a triangle!) an interesting story, unfortunately badly told. The image is sometimes weird, sometimes OK, the picture looks crowded and narrow-sighted. The sound needs more attention (it usually does in Romanian movies), the light and color filters are sometimes badly chosen. The soundtrack is short and is not helping the action. About the acting... sorry but the best actress is the landlady. The others are acting immaturely and cannot convince the viewer. The acting is poetical when it should be realistic, and realistic when it should be poetical. It's a picture for adults, told by the children. Bother only if extremely curious.", "LBL": "negative"}
{"TEXT1": "Closer to reality and containing more depth than \"Breakdance\", Stan Lathan's \"Beat Street\" is still a pretty dull show. Again this pic is really only cashing in on the 'breakin' craze but at least we get a little bit of entertainment from the plot, which concerns the lives of three young friends and a younger brother, all growing up in Queens, New York. Each has their own unique talent. One is a hustler, one a d.j., another an artist who creates 'burners', while little bro' Lee is a hot 'hip hop' dancer.<br /><br />Lathan is unable to generate any real audience interest in the story though, and his young cast are likewise struggling with their characters. Therefore it is left almost entirely to the funky music and the 'fresh' dancing to save the day.<br /><br />Choreography is again sharp for both club and street scenes, but this alone is not enough to lift \"\"Beat Street\" to greater heights. Unfortunately the film really falls flat late on, after showing a glimmer of hope that it just might get interesting.<br /><br />Sunday, August 25, 1996 - Video", "LBL": "negative"}
{"TEXT1": "Hilariously obvious \"drama\" about a bunch of high school (I think) kids who enjoy non-stop hip-hop, break dancing, graffiti and trying to become a dj at the Roxy--or something. To be totally honest I was so bored I forgot! Even people who love the music agree this movie is terribly acted and--as a drama--failed dismally. We're supposed to find this kids likable and nice. I found them bland and boring. The one that I REALLY hated was Ramon. He does graffiti on subway trains and this is looked upon as great. Excuse me? He's defacing public property that isn't his to begin with. Also these \"great\" kids tap into the city's electricity so they can hold a big dance party at an abandoned building. Uh huh. So we're supposed to find a bunch of law breakers lovable and fun.<br /><br />I could forgive all that if the music was good but I can't stand hip hop. The songs were--at best--mediocre and they were nonstop! They're ALWAYS playing! It got to the point that I was fast-forwarding through the many endless music numbers. (Cut out the music and you haver a 30 minute movie--maybe) There are a few imaginative numbers--the subway dance fight, a truly funny Santa number and the climatic Roxy show. If you love hip hop here's your movie. But it you're looking for good drama mixed in--forget it. Also HOW did this get a PG rating? There's an incredible amount of swearing in this.", "LBL": "negative"}
{"TEXT1": "Maybe you shouldn't compare, but Wild Style and Style Wars are original Hip Hop. Beat Street does have a lot of the original artists of early Hip Hop, but they've been obviously made clear that this could be their big break, of course for some it was and that's nice. But if you view this as original Hip Hop Culture you're wrong. It's overproduced and has a Hollywood sauce. Rather look for the first two movies i mentioned. They have convey the grittiness that comes with life in the ghetto. Yes, the rating for this movie is low, but the reviews are mostly positive or even raving. This is probably because although the story, the acting, the dialogues and the direction all are dreadful, the music and dancing is what the people love about it. Me, i do love the dancing but at the time thought that electro was the death of Hip Hop (i was so glad when round '86 a new generation of now classic Hip Hop artists appeared, like Krs One, Public Enemy, Ultramagnetic Mc's, Jungle Brothers, Bizmarkie to name a few), and i still don't like most of the beats in this movie and that is why it doesn't work for me. I mean, Wild Style has not much of a story but the music there is great and authentic. Of course tastes differ and that's alright. But as far as i'm concerned, this movie is trash except for the break dancing and some of the music and so i can't rate it higher than a 4 out of ten.", "LBL": "negative"}
{"TEXT1": "I could never stand watching Happy Days after Chachi joined the cast, so I knew I was in trouble when the best scene in this movie featured Scott Baio (a skateboard chase scene!). Jodie Foster in her first \"grown-up\" role turns in her usual professional performance but that is no excuse for this boring mess. Two hours out of my life that I'll never get back! No noteworthy characters, unbelievable storyline, questionable editing and horrendous cinematography but worst of all, I couldn't have cared less. The story of California teens in the 1970's, where the kids live miserable lives and all their parents are idiots. Don't waste your time watching this ugly excuse for a movie.", "LBL": "negative"}
{"TEXT1": "Horrible film with bits of the Ramones strewn about. Your worse than average 1970's/80's comedy format of the cool kids taking over the school with some whimsical plan. This movie is terrible. The plot consists of a girl who enjoys the Ramones and a school bent on fighting against their oppressive administration. Forget this movie and watch something like Wild Zero starring Guitar Wolf if you want an entertaining B movie. Terrible acting, terrible writing, terrible plot with the stamp of approval of the Ramones who probably needed some money quick so they said yes to this movie. That is the only logical thing I can think of because this movie blows.", "LBL": "negative"}
{"TEXT1": "This movie is a 90 minute Ramones concert with brief periods of stupidity and absolute boredom. What kind of high school is this anyway?<br /><br />Unless you are a major Ramones fan, DO NOT and I repeat DO NOT waste your time like I did. This is utterly unwatchable from start to finish. This movie should be called Ramone Fever. Everyone appears to like them in this movie. There is not a plot to be found in this flick. As far as teen comedies go, you are scraping the bottom of the barrel with this one.", "LBL": "negative"}
{"TEXT1": "I gave this film 2 stars only because Dominic Monaghan actually put effort through in his acting. Everything else about this film is extremely amateur. Everything associated with the direction of this film was very poorly executed. Not only should the director rethink what she is doing for a life career but maybe she should watch a few films. As Dominic Monaghan is a very credible actor, placing him in a film of this caliber makes him look awful. Whomever the \"actor\" was that played Jack's best friend should never have stepped in front of the camera. I didn't expect much from such a small film, but perhaps a little more time and effort should be put into the characters and their surroundings. Don't waste your time or money on this film (like I did) you will be sorely disappointed.", "LBL": "negative"}
{"TEXT1": "I jumped at the chance to view this movie uncut and uninterrupted, remembering rahs and raves for it. But wherever it seemed about to slip into being truly scary, it backed off and went somewhere else. The dripping water throughout the house, the black rain, the prophetic dreams, taking the wrong turn in raw sewage were dropped before they could work up to a scream.<br /><br />What a disappointment. Chamberlain's nearly expressionless mask of a face offered little but confused disbelief, something I found myself mirroring as the film wore on. What could have been eerie Aboriginal chanting and instruments in the background were instead a cacophony seemingly designed to beat terror into one's head. The ideas that modern people can embody ancient gods, that the Aboriginal peoples believe red-haired white men were the first priests, and many other possibilities are passed along more like a shopping list than a hint at another dimension (the Dream Time).<br /><br />[SPOILER] In the final scene, it wasn't clear to me what the director was trying to tell. Is there a big wave? So what? How big? A tsunami? Yeah, okay. That's devastating but not apocalyptic. Is it the end of the world? From a wave? The last wave? That'd have to be a pretty darn big wave. Why? Was the world that bad a place? It didn't seem so awful in this movie. Actually I didn't think the wave came off, since the shadow left Burton's face that had been cast by the wave. Was it only Burton's apocalypse? Heck, that happens every day to people who lose it. It wasn't of any interest if it was only him.<br /><br />The most frightening scene, and the one that gives the best indication of Weir's potential, was in Charlie's apartment where Burton has gone to confront the old man for scaring Burton's wife. Charlie keeps asking him \"Who are you?\" and it becomes truly disturbing after a while. Unfortunately, the movie never followed suit.", "LBL": "negative"}
{"TEXT1": "The perfect murder is foiled when a wife(played by Mary Ellen Trainor, once the wife to director Robert Zemeckis, who helmed this episode), who murders her husband with a poker, has the misfortune of receiving a visitor as she is about to move the body outside..an escaped insane madman dressed in a Santa Claus suit(played by a deviously hideous Larry Drake). She fends for her life while trying to find a way of hiding her husband's corpse. She decides to use an ax, once she downs the Santa killer who misses several chances to chop off the woman's head, to frame the killer for her husband's murder. Santa killer locks her in a closet and pursues the woman's daughter as she tries desperate to free herself to save the child.<br /><br />This episode of TALES FROM THE CRYPT just recycles tired material involving the old \"Santa kills\" theme while also adding the oft-used(add nauseum)woman-murders-her-husband-for-a-man-she's-been-cheating-with routine. It's essentially Trainor trying to find a way to avoid being caught with a dead body she kills while also keeping a safe distance from a maniac. There's nothing refreshing or new about this plot which pretty much goes through the motions. Not one of the show's highlights.", "LBL": "negative"}
{"TEXT1": "Well, as Goethe once said, there really isn't any point in trying to pass a negative judgement that aspires to be objective on \"something that has had a great effect\". \"La Maman et La Putain\" has surely passed into history as an influence on much of what's been done in France and elsewhere in the past thirty years and no one interested in the history of film, certainly, should be dissuaded from watching it. To express a purely subjective judgement, however, I feel compelled to disagree with almost every other review posted here and say to people: \"Don't watch it; it's a waste of hours of your time that will just leave you feeling rather sick and angry.\" And by that I don't mean \"sick and angry\" about \"the human condition\" or anything so general and profound as that, because that is exactly the line that most critics have adopted in their fulsome praise of the film - \"an ordeal to watch in its ruthless dissection of our emotional cowardice and cruelty\" and so on - and, if it really managed to put across a universally or even broadly relevant message of this sort, then the director would have good reason to be satisfied with himself, however pessimistic his conclusions may be. My beef with the film is rather that I don't see this hours-long record of empty vanity and petty treachery as being justified or excused by any GENERALLY relevant message at all. All three main characters are deeply morally unattractive individuals: Alexandre to the greatest degree, of course, because we see by far the most of him and because he seldom shuts up for more than thirty seconds; Marie perhaps to the least degree, because we see the least of her. Alexandre's affected and pretentious monologues have a kind of amusement value, of course, but the amusement wears thin as one comes more and more clearly to realize that Jean-Pierre Léaud is most likely not even acting and that, with absurd remarks like \"un homme beau comme un film de Nicholas Ray\", he really was just reproducing word-for-word opinions that were accepted as authentic and profound by the milieu in which he, along with the director Eustache, had been living for about ten years by the time of the making of the film. I suppose if the tone of relentless superficiality and triviality had been sustained throughout 100% of the film, it might have worked as a long sardonic comedy about a particularly shallow, worthless and despicable post-'68 milieu. What made, however, this viewer at least extremely angry with the director was his granting of at least one lengthy scene each to Alexandre and Veronika in which we are clearly expected to empathize with and feel for them as if they shared a moral universe with us. If a man can get away with living in the flat of and professing to love one woman, sleeping (mostly in this very flat) with another, and running around Paris proposing marriage to yet a third, well, I suppose I can wish him the best of luck in the dog-eat-dog world he's chosen to create for himself. What I can't, however, in all conscience do is listen even for a moment to maudlin monologues from him in which he speaks about his \"anxiety\" and his \"despair\". The same goes double for the even more despicable Veronika, whom we are shown barging drunk into the apartment and even the bed shared by Marie and Alexandre and behaving there with an infantile inconsistency tantamount to the most savage and heartless cruelty. As I say, if \"La Maman et La Putain\" is intended to be nothing more nor other than a portrait of Alexandre, Veronika and Marie, three individuals whom any even halfway decent person would never admit into their company let alone their home, then I suppose there is a kind of legitimacy in praising the director for being \"unflinching\" (though why one should even feel like \"flinching\" once one had consciously opted to create such thoroughly repellent characters to filmically observe I can't imagine). The problem, however, is that the director is clearly convinced - and appears to have succeeded in convincing generations of critics - that Alexander, Veronika and Marie are somehow representative of human beings in general and of the limits of human beings' emotional capabilities. This latter idea, however, is arrant and offensive nonsense. There may indeed be an inherent fallibility and tendency to tragedy in human relations in general and sexual relations in particular. But the nature and degree of this fallibility and tendency to tragedy can only possibly be determined by people who make a sincere and serious effort to make such relations work. It surely needs no cinematic or authorial genius to convey to us the information that a man who behaves like Alexandre is going to end up hated, miserable, and alone, or that women who insist on expecting love from a man like Alexandre are going to end up disappointed and bitter. Watch \"La Maman et La Putain\" if you're historically interested in what passed for culture and human interaction in a certain post-'68 Parisian milieu which was probably, unfortunately, not restricted to just a few particularly anti-social types like these. But please don't make the mistake of believing that what is recorded here has any general relevance for humanity in the way that a film by Jean Renoir or Martin Scorsese might be argued to have.", "LBL": "negative"}
{"TEXT1": "That's not the sound of bees, that's the effect induced by watching this extremely long, extremely boring, badly acted movie. How I ever made it through all 3 1/2 hours without falling asleep I'll never know. The plot is simple...3 thoroughly unlikable morons talk about sex for 3 1/2 hours. And you thought Rohmer was deadly. This is even worse, if that's possible. > I must really be a masochist if I could watch this entire movie without turning it off...or killing someone.", "LBL": "negative"}
{"TEXT1": "Iberia is nice to see on TV. But why see this in silver screen? Lot of dance and music. If you like classical music or modern dance this could be your date movie. But otherwise one and half hour is just too long time. If you like to see skillful dancing in silver screen it's better to see Bollywood movie. They know how to combine breath taking dancing to long movie. Director Carlos Saura knows how to shoot dancing from old experience. And time to time it's look really good. but when the movie is one and hour it should be at least most of time interesting. There are many kind of art not everything is bigger then life and this film is not too big.", "LBL": "negative"}
{"TEXT1": "Super Speedway makes a great demo of your new DVD / bigscreen / 5.1 channel sound system. The IMAX camera puts you right in the race car, where you cruise around various tracks at high speed, reminiscent of the driving sequences in Grand Prix (if only that would appear on DVD!). I enjoy watching it again and again.<br /><br />The only minus, and why I didn't give it a 10, is some of the driving sequences look suspiciously like the film was speeded up. The soundtrack also requires a little suspension of disbelief - all you can hear in a real car is the engine. You won't hear swooshes as you go under bridges.", "LBL": "positive"}
{"TEXT1": "I was not expecting much from this movie, but was very pleasantly surprised, as it is light and funny and very well observed. The central trio of deadbeat bikers were surprisingly likable as they staggered and clowned their way through their drug-centred trip to Wales. The humour was gentle and subtle, as indeed were the three characters (witness their sympathetic treatment of the little old lady shopkeeper). The atmospherics of rural Wales were captured perfectly, and the soundtrack was very well chosen. Cleverly and carefully scripted, with great attention to detail - I have never seen such a realistic portrayal of alternative culture - I felt I was there with them. Very light in touch and full of fun - not what you might expect from a movie about bikers and drugs. A delight on all fronts, and difficult to criticise, though I thought the last two scenes were a bit lame - the film should have ended when they left Wales. But overall, an unexpected treasure of a film.", "LBL": "positive"}
{"TEXT1": "I saw a preview of Freebird at the Isle of Man TT as i had heard about it in a couple of motorcycle mags. Although i was over mainly for the racing, the lure of seeing Phil Daniels in a motorcycle movie (yes i love Quadrophenia like everyone else) proved enough to get me away from the beer and partying. At last! we've done it! us British have actually made a great motorcycle film (and no it's not like Torque) this is up there with the best of British comedy. Mark my words, this is Phil Daniels best screen performance, and as far as Geoff Bell is concerned, there's a new British legend making his name felt. I loved Gary Stretch in Shane Meadows' fantastic Dead Mans Shoes and here he gives a quietly touching performance that he can proudly add to his growing film reputation. This is a film not just for us Bikers, but I think for everyone (even my girlfriend loved it). I hope it gets the same brilliant response on the mainland as it got at the Isle of Man. I'm not going to go into the details of certain classic scenes that this movie has, (watch out for the shop), as it would spoil the fun, but i would say, go see, enjoy, and have one of the best nights in the cinema you've had in a while. I really think this could well be a cult classic. As they were saying at the TT... C'Mon Freebird!", "LBL": "positive"}
{"TEXT1": "A comedy gem. Lots of laugh out loud moments, the shop and pub scenes had me belly- laughing uncontrollably. The characters are recognisable and the dialogue well-observed - I know people like this! The humour is surprisingly gentle and the film (this may sound strange) puts me in mind of an Ealing Comedy. It's a quirky little film with lots of detail. It certainly takes a number of viewings. I've watched it a few times (I've been showing all my friends!) and notice something new each time - a bit of dialogue,something visual that I hadn't picked up on before. I could get really picky and find a couple of shortcomings in the film but I'm not going to because overall this is a great fun, feel-good film which is really worth a watch and which anyone with a sense of humour must enjoy. It is a film which will find it's friends and I hope there are a lot of them out there. Oh.... and It has a great soundtrack.", "LBL": "positive"}
{"TEXT1": "Highly recommended!!<br /><br />A well written, funny film which will appeal to everyone out there with a sense of humour!!!. Give it a go, it's good to see an Independent British Movie more than holding it's own against the big established studios!! Definitely worth adding to any film collection. There are scenes in this film that I'm sure a lot of people will be able to relate to. You will laugh out loud at the antics and enjoy the great soundtrack. I especially enjoyed the Orb's version of Jimmy Cliff's Vietnam and The Tower of London's take on Freebird. <br /><br />Go on give it a go............ you won't be disappointed.", "LBL": "positive"}
{"TEXT1": "This is a great British film. A cleverly observed script with many quotable lines, which captures perfectly what magic mushrooms can do to a man over a weekend. As per usual Phil Daniels is excellent along with that most under rated of British actors Geoff Bell. Peter Bowles with a joint hanging out of his mouth is a casting masterstroke and Gary Stretch with his brooding looks brings something strangely atmospheric to the piece. Although it seems to be billed as a biker movie, i think it will find an audience outside of this, purely on the premise that a lot of people have been there done it and got the t-shirt. also A great original soundtrack with a blinding version of Freebird. This really could be a 21st century heir to the famous Ealing comedies. Like the weed in the Welsh fields: it's a grower!", "LBL": "positive"}
{"TEXT1": "At last! A decent British comedy that isn't centred around some mockney bank robbers or spun off from a TV series. John Ivay's film is a psychoactive tale of discovery, dressed in biker gear. The three protagonists are gentle fools with a penchant for failure and each at a turning point in their lives, giving a sensitive, emotional trio of sub-plots to sew the riotous comedy together. The chemistry between the three amigos is palpable and makes for a touching companionship with hilarious dialogue and some classic comedic moments. It feels part Withnail and I, part American Werewolf in London, and part Quadraphenia (but only because of the bike gangs, and Phil Daniels). In fact, Phil Daniels' lovable rogue reminds you of Danny the dealer in Withnail and I, with his scholarly approach and scientific commitment to drugs. This is a great film, particularly for those who've dabbled in psychoactive substances in the past, who will relate to many moments in the film. A personal favourite is the brilliant scene in the Welsh corner shop, buying munchies while tripping on 'shrooms. This gentle comedy will warm the cockles of your heart and have you laughing out loud. And you don't have to ride bikes or even like them to enjoy it. But it'll add to it if you do. Brilliant.", "LBL": "positive"}
{"TEXT1": "Freebird is the perfect marriage of road trip comedy, gang caper, \"stoner\" film and feel-good British movie.<br /><br />It is the brilliant lead characters that set this movie apart from other films in this genre. Stars Phil Daniels, Gary Stretch and Geoff Bell have a great chemistry and make their characters hugely likable and realistic. The main story centres around their road trip from London to Wales, and the adventures and mishaps that occur along the way. This small film also has a great heart - it is not just for bike fans, as it bases around the character's relationships with each other including dreams and regrets, such as Gary Stretch's Fred longing for the family he left behind. The cinematography is also great - a love letter to the Welsh countryside as well as capturing the grittiness of London streets and typical pub life in the Welsh country towns.<br /><br />Stylish, slick, fantastic soundtrack, likable characters and funny storyline - I would recommend Freebird in a heartbeat!", "LBL": "positive"}
{"TEXT1": "What a class bit of British cinema! It's about time. And a side splitting comedy to boot!<br /><br />Anyone searching to relive a bit of freedom from their misspent youth this road movie will prove the ticket.<br /><br />It's a mix between \"Withnail and I\" and \"Easy Rider\". The movie runs at a solid pace and doesn't let you drift off for too long... At times there are reflective moments, but I think they are well justified and add to the characters the actors are portraying. I was a little concerned with Phil Daniels character at the start but thankfully was won over half way through in what was one of the funniest scenes of the entire movie! Generally I found myself belly laughing through the film most likely annoying some people around me. Oh well.<br /><br />I would thoroughly recommend it. This will become a cult British comedy. Well worth a visit.", "LBL": "positive"}
{"TEXT1": "The brilliant thing about Withnail & I is that it captures that not long left college and life could go either way moment along with all its other finery. Freebird is something for those who probably never considered higher education and just went straight to work aged 15/16. I know some of the broad sheets stuck the knife into this film when it came out in Cinemas but i saw it at a packed house in Hailsham and everybody seemed to really enjoy it. I grew up in the forest of Dean and this took me straight back to my mushrooming and dope days (had some great mates - hate to think what they're all up to now - probably running the local council). I've watched it a couple of times on DVD and already i see the film as an old mate that will stay forever as part of my collection (how can i like this film and the Dambusters - doesn't seem right somehow) I certainly edge towards the second half of this film and i think the social interacting scenes with the locals are brilliantly done. I like the mix of the three lead characters and there really is some lovely writing in here along with some very quotable lines and dare i say a good smattering of integrity. I have tried to obtain the soundtrack, but it has not been released (shame, as it's a corker). Someone told me it was originally a stage play, not quite sure how that worked but i'm sure it was fun. I liked the little Shakespearian touches/references that seem to crop up throughout the film (also spotted the Dylan Thomas ref as well) and like all little gems, there will always be little things to discover like the final scene giving a nod to Easyrider as they start they're next journey. All in all a genuinely unpretentious piece of film making (love it!)", "LBL": "positive"}
{"TEXT1": "I was pleasantly surprised by the film. Let's face it; the premise doesn't sound particularly appealing when having to hand over money for a the night's flick, but it had an easygoing nature that wins one over. There were no moments that I found uproarious, and I doubt any that I'll remember the next day, but this doesn't fail as a nice diversion. What I found funny was watching it here in Peking with my Chinese girlfriend who never understands anything I like. I told her there was a plot- three guys have to bring back some weed to London. Hardly satisfying for her. There is no mugging going on here for the camera which I'd been expecting after reading a number of the comments. I do take exception however to comparisons with Withnail and I; not in the same league, and I doubt was it intended to. www.imperialflags.blogspot.com", "LBL": "positive"}
{"TEXT1": "I was in the film too, but i don't know if they actually put this scene in. On the way back from a school trip (in 2005) we stopped at a service station at the same time as they were doing the film, and we were asked (the whole of us) to run in and shout Go! Freebird! We were all around 10 years old, could anyone who has seen the film tell me if that part was actually kept in the film, it would be great to know! I remember I thought the film had never come out, because it was another 2 and a half years before it was released. All of your comments seem to be good so I'm guessing it has been quite a successful film, I might buy it, but first I would like to know if I'm in it! :D Thank you", "LBL": "positive"}
{"TEXT1": "A great British Indy movie! Fantastic chemistry between the 3 main characters make for some hilarious drug-fuelled set pieces that Cheech and Chong would be proud of. Great to see Phil Daniels back on the big screen (even if he has swapped sides since Quadrophenia!) and Gary Stretch is surprisingly good and a treat for the ladies! Loved the final fight scene with it's nod to Zulu and now I know what happened to Arthur Brown after he set himself on fire on Top of the Pops!...he's not acting....he really is a bona-fide British hippie!!! You don't have to be a biker to enjoy this and it's straight into my Friday night post-pub repeat viewing collection. <br /><br />Give this film a go and you won't be disappointed.", "LBL": "positive"}
{"TEXT1": "I have seen the freebird movie and think its great! its laid back fun, about time the British film industry came through with something entertaining!! its good how the guy who met them at the service station gets mentioned way into the film in the news agents, nice touch. The acting was convincing (i am a biker) they reminded me of some good times i have had in the bike scene. It was good to see the film director getting in on the acting, well done jon ! At the end a new crop gets mentioned, in Ireland is this the foundation for a 2nd film? hope so keep them coming. Great film , well written, realistic characters !", "LBL": "positive"}
{"TEXT1": "Running out of films to rent, I picked up Freebird. I struggled through the first third of the movie wondering if the rest would be a waste to see. Fortunately, it really warmed up, and I loved the movie quite a bit. The second half of the movie had me grinning and laughing the entire time. Thankfully, although there were bits of CGI included, they were not overdone or prevalent.<br /><br />I would have to say, though - the actors all have heavy European accents, so be warned if you have trouble understanding those voices or their cultural humor.<br /><br />I really loved this movie, and will have to order myself a copy for my own collection.", "LBL": "positive"}
{"TEXT1": "This is one to watch a few times. The excellent writing shows they had to have lived this story or know someone whom did because they nailed it. Freebird made me relive and laugh at my misspent youth. The title was a Great choice. Great film, setting, story, soundtrack and characters. It's a biker flick but would be a shame to pigeon hole it that way. Funny to the bone, kinda like Trailer Park Boys in the U.K. If you've never seen TPB, make a point to if you like this film. You will thank me. I hope to see more of these characters in other films. Sequel? Could be done. There's a whole lot more of the world I would like to see through their eyes.", "LBL": "positive"}
{"TEXT1": "I simply never tire of watching FREEBIRD. My husband was an extra so I was involved from the start. Have kept in touch with Jon and have helped out with promoting the film both in Cinemas and now the DVD release. Even to the extent of distributing promotional postcards on cross channel ferries and various places throughout France. FREEBIRD was expertly written and directed with the perfect combination of fun and serious moments plus choice casting. Only Phil Daniels could fit the role of Grouch. Great privilege to meet Jon and the cast at the party following the premier in January. Anything else you want doing Jon just ask, either email or phone, you know how to get me. Sue xx", "LBL": "positive"}
{"TEXT1": "Was lucky enough to be an extra in this great film and loved every minute of the filming. Went to the premier in London and had a great chat to Phil, Peter, Martin, and Jon as did my wife.Fantastic after party too. Then a few weeks later had trip to the cinema with members of our bike club. What a brilliant film, it deserves to be up there with all the great biker films. Now we have the DVD Sue my wife can't get enough of it neither can the kids. Get a bit of stick from the club who seem to think I'm a film star now oh well one can only dream. I think they are just jealous. The only downside of the first part of the filming was the weather, rain, rain and more rain but hey we was in Wales. Hopefully there will be a follow up so keep me posted Jon. Danny Beck", "LBL": "positive"}
{"TEXT1": "But the opposite, sorry bud, i completely understand how you can be dragged into a film because you relate to the subject ( and you have). This film is terrible, the main character would give any charlie brown subtitler a run for his money he just constantly mumbles which is always a laugh, most scenes just feel awkward with characters more often than not gazing across to another with a look of...its your line now, then i will react. Best British comedy? Please buddy, have a strong word with your bad bad self...at the end of the day ...the sun goes down...and this film is Awful. I mean well done to the people involved...they have made a film...and maybe motorbike enthusiasts may be into it but people that still live here on earth with an actual sense of humour will struggle with this more than smiling at the Christmas present they're nan bought them...was that overly harsh? i do apologise...", "LBL": "positive"}
{"TEXT1": "What a GREAT British movie, a screaming good laugh and sexy Gary Stretch too, and oh, lots of bikes and lovely Welsh countryside.<br /><br />Members of our club the ARROWHEAD Bike and Trike Social Club appear in it as extras! Hooray!! <br /><br />There are some genuinely hilarious bits, good acting, a good idea.<br /><br />Met the director, Jon Ivay at a showing in Wareham, Dorset. A great man, down to earth and a good laugh. This film must be supported, as all great Brit movies should!<br /><br />So please go and see it if you can, they have a website with cinemas that are showing it , so find one near you!<br /><br />I can't wait to get the DVD. Some of our biker friends have seen the film two or three times already and can't get enough of it.<br /><br />Amanda", "LBL": "positive"}
{"TEXT1": "I am decidedly not in the target audience for this film. I am a man nearly 50 who has only recently stumbled across the world of independent film. This happened quite by accident, with the discovery of a movie called Clerks late one night on television. The first two things I noticed about that film were that it was 1) technically amateurish and 2) brilliantly written. When I read an interview with the director in the local paper and he said that one of his influences was Clerks, I started to get interesting. When he said his main influence was The Station Agent, a movie I'd seen on DVD a week prior, I decided I had to go and check it out. The result could be described along the same lines as Clerks, although the two films are nothing alike content wise. Both films suffer from technical gaffes that are overcome through amazing writing. Whereas Clerks is a day in the life of a man who has nothing in his life at all and is afraid to ask tough questions about himself and his situation, Less Like Me is about a man who seemingly forces himself to be constantly busy, he's always running one way or another, filling his life with little things so that he will never have to deal with the big ones. The themes and ideas of this film are strong and poignant. I can tell from watching it that not much has changed since I was growing up, young men still have the same problems they always have. The writer dresses up these problems and themes in the modern vernacular, crafts wonderfully honest characters, and has them do completely believable things. As far as indie cinema goes, this may not be perfect from a technical standpoint, but from an artistic one, it is very close.", "LBL": "positive"}
{"TEXT1": "I am decidedly not in the target audience for this film. I am a man nearly 50 who has only recently stumbled across the world of independent film. This happened quite by accident, with the discovery of a movie called Clerks late one night on television. The first two things I noticed about that film were that it was 1) technically amateurish and 2) brilliantly written. When I read an interview with the director in the local paper and he said that one of his influences was Clerks, I started to get interesting. When he said his main influence was The Station Agent, a movie I'd seen on DVD a week prior, I decided I had to go and check it out. The result could be described along the same lines as Clerks, although the two films are nothing alike content wise. Both films suffer from technical gaffes that are overcome through amazing writing. Whereas Clerks is a day in the life of a man who has nothing in his life at all and is afraid to ask tough questions about himself and his situation, Less Like Me is about a man who seemingly forces himself to be constantly busy, he's always running one way or another, filling his life with little things so that he will never have to deal with the big ones. The themes and ideas of this film are strong and poignant. I can tell from watching it that not much has changed since I was growing up, young men still have the same problems they always have. The writer dresses up these problems and themes in the modern vernacular, crafts wonderfully honest characters, and has them do completely believable things. As far as indie cinema goes, this may not be perfect from a technical standpoint, but from an artistic one, it is very close.", "LBL": "positive"}
{"TEXT1": "Last November, I had a chance to see this film at the Reno Film Festival. I have to say that it was a lot of fun. A few tech errors aside, it was a great experience. I loved the writing and acting, especially from the guy that played the lead role. There is a lot of heart in this movie, a lot of wit to. I got a chance to speak with a few of the filmmakers after it was done, and they seemed real nice. All in all the whole movie was just a positive experience, and one I'd definitely recommend. The story was entertaining and cool, as a woman I've been through a lot of the same problems as the lead guy, and I could really understand his problems because of it. The movie does a great job of giving us people we can sympathize with. The friends in the movie are really well written to, they are realistic. I know people like these, I only wish Imy friends and I could sound as cool as these people when we talk. The whole movie is just real cool, I wish there were more films out there like it.<br /><br />- Jayden", "LBL": "positive"}
{"TEXT1": "I would just like to state that this may be biased, as I am a producer on the film. However, I will maintain some sense of dignity.<br /><br />The star of the film, Oscar Ovies, gives a stellar performance as Jeff Grinderlin, a nebbish hypochondriac who spends more time worrying than living. He brings a certain touch to his character that really allows the audience to connect with him, by stating his mind often and with a sense of harsh comedy. His mother, played by Christine Haber, is the constant support beam, that without, he would crumble upon himself. His friends also lend a hand in Jeff's life, often making choices for him rather than letting him use his free will... which often times he neglects is there anyway. <br /><br />The writing is superb, and the conversations flow like scenes from a Kevin Smith movie, with half as much Ben Affleck boo-hoo fests.<br /><br />The camera work is a little shoddy at some points, and the sound could also use a boost, however the performances out shine the minor details. It is also backed by a beautiful soundtrack with local talents and an exceptional composer.<br /><br />All in all, this was a treat. A rare gem, among many jewels.", "LBL": "positive"}
{"TEXT1": "Antonioni really showed some 'cojones' when he had this movie made. He went to America working under a contract from the most lavish studio (MGM) and he made the most damning portrait of American society i've ever seen. Having seen LA first hand this is the most accurate portrayal of the crowded, overheated and impersonal city. If only Antonioni had met Bill Hicks...<br /><br />The subsequent burial by the studio is understandable, after such a whopping investment and dismal return. It is sad that people don't get to see this film any more as i believe Antonioni has been proved right. Here he predicts the end of the hippie/civil rights movement in the politics of America. Everyone is much more interested in what goes into their pockets and the relentless expansion of living space into the inhospitable (yet beautiful) desert and beyond. How i would love to see interest in this film re-kindled and a lavish DVD release.<br /><br />I beseech people to watch Zabriskie Point with an open mind and an open heart. We have a genuinely unique film commenting on a turning point in the history of the most powerful nation on the planet, and we have forgotten about it.<br /><br />An unexpected gem.", "LBL": "positive"}
