{"TEXT1": "If the crew behind \"Zombie Chronicles\" ever read this, here's some advice guys: <br /><br />1. In a \"Twist Ending\"-type movie, it's not a good idea to insert close-ups of EVERY DEATH IN THE MOVIE in the opening credits. That tends to spoil the twists, y'know...? <br /><br />2. I know you produced this on a shoestring and - to be fair - you worked miracles with your budget but please, hire people who can actually act. Or at least, walk, talk and gesture at the same time. Joe Haggerty, I'm looking at you...<br /><br />3. If you're going to set a part of your movie in the past, only do this if you have the props and costumes of the time.<br /><br />4. Twist endings are supposed to be a surprise. Sure, we don't want twists that make no sense, but signposting the \"reveal\" as soon as you introduce a character? That's not a great idea.<br /><br />Kudos to the guys for trying, but in all honesty, I'd rather they hadn't...<br /><br />Only for zombie completists.", "LBL": "negative"}
{"TEXT1": "An uptight voyeur who wants to commit suicide encounters a free spirited bad-seed who has 5 weeks to live and then they're off to discover America. Get the idea? There's not an original moment in this whole movie.", "LBL": "negative"}
{"TEXT1": "1st watched 8/3/2003 - 2 out of 10(Dir-Brad Sykes): Mindless 3-D movie about flesh-eating zombies in a 3 story within a movie chronicle. And yes, we get to see zombies eating human flesh parts in 3D!! Wow, not!! That has been done time and time again in 2D in a zombie movie but what usually makes a zombie movie better is the underlying story not the actual flesh-eating. That's what made the original zombie classics good. The flesh-eating was just thrown in as an extra. We're actually bored throughout most of this 3-part chronicle because of the lame(twilight-zone like) easily understood and slow-pacingly revealed finale's. The last story is actually the story the movie started with(having a reporter investigating a so-called ghost town) and of course we get to see flesh eating zombie's in that one as well. Well, I think I've said enough. Watch the classics, not this 3D bore-feast.", "LBL": "negative"}
{"TEXT1": "There's tons of good-looking women in this flick. But alas, this movie is nudity-free. Grrrrrrrrrr Strike one.<br /><br />Ahem. One story in this film takes place in 1971. Then why the hell are the main characters driving a Kia Sportage? Hello? Continuity, anyone?<br /><br />As you might know, this movie was released in stereoscopic 3D. And it is the most hideous effect I have ever seen. I'm not sure if someone botched the job on this, but there WAS no 3D, just double-vision blurs. I didn't have the same problem with this company's other 3D movies, HUNTING SEASON and CAMP BLOOD. Sure, the 3D in those ones sucked too, but with them I could see a semblance of 3D effect.<br /><br />This thing is a big ball of nothing.<br /><br />And whoever that women was who played the daughter of the ear-eating dame, yum! I'd like to see more of her. In movies, as well. Looks like Janet Margolin at a young age. Purrrrrrrrrrrrrrrr<br /><br />", "LBL": "negative"}
{"TEXT1": "Without wishing to be a killjoy, Brad Sykes is responsible for at least two of the most dull and clichéd films i've ever seen - this being one of them, and Camp Blood being another. <br /><br />The acting is terrible, the print is shoddy, and everything about this film screams \"seriously, you could do better yourself\". Maybe this is a challenge to everyone to saturate youtube with our own zombie related crap?<br /><br />I bought this for £1, but remember, you can't put a price on 71 minutes of your life. You'd do well to avoid this turkey, even at a bargain basement price.", "LBL": "negative"}
{"TEXT1": "My girlfriend once brought around The Zombie Chronicles for us to watch as a joke. Little did we realize the joke was on her for paying £1 for it. While watching this film I started to come up with things I would rather be doing than watching The Zombie Chronicles. These included:<br /><br />1) Drinking bleach 2) Rubbing sand in my eyes 3) Writing a letter to Brad Sykes and Garrett Clancy 4) Re-enacting the American civil war 5) Tax returns 6) GCSE Maths 7) Sex with an old lady.<br /><br />Garrett Clancy, aka Sgt. Ben Draper wrote this? The guy couldn't even dig a hole properly. The best ting he did was kick a door down (the best part of the film). This was the worst film I have ever seen, and I've seen White Noise: The Light. Never has a film had so many mistakes in it. My girlfriend left it here, so now I live with the shame of owning this piece of crap.<br /><br />News just in: Owen Wilson watched this film and tried to kill himself. Fact.<br /><br />DO NOT WATCH", "LBL": "negative"}
{"TEXT1": "Amateur, no budget films can be surprisingly good ... this however is not one of them.<br /><br />Ah, another Brad Sykes atrocity. The acting is hideous, except for Emmy Smith who shows some promise. The camera \"direction\" needs serious reworking. And no more \"hold the camera and run\" gimmicks either; it just doesn't work. The special effects are unimaginative, there's a problem when the effect can be identified in real time. If you're going to rip off an ear, please don't let us see the actor's real ear beneath the blood. The scenery is bland and boring (same as Mr. Sykes other ventures), and the music is a cross between cheap motel porn and really bad guitar driven metal (see the scenery comment).<br /><br />Did I mention the lack of any real plot, or character development? Apparently, the scriptwriter didn't.<br /><br />Whoever is funding this guy ... please stop. I've seen some of his other \"home movies\" (which I will not plug) and they are just as bad. Normally, a \"director\" will grow and learn from his previous efforts ... not this guy. It's one thing to be an amateur filmmaker, but anyone can be a hack.<br /><br />Definitely not even a popcorn film ... of course, chewing on popcorn kernels would be less painful than this effort.<br /><br />Award: The worst ever military push-ups in a film.", "LBL": "negative"}
{"TEXT1": "OK its not the best film I've ever seen but at the same time I've been able to sit and watch it TWICE!!! story line was pretty awful and during the first part of the first short story i wondered what the hell i was watching but at the same time it was so awful i loved it cheap laughs all the way.<br /><br />And Jebidia deserves an Oscar for his role in this movie the only thing that let him down was half way through he stopped his silly name calling.<br /><br />overall the film was pretty perfetic but if your after cheap laughs and you see it in pound land go by it.", "LBL": "negative"}
{"TEXT1": "I received this movie as a gift, I knew from the DVD cover, this movie are going to be bad.After not watching it for more than a year I finally watched it. what a pathetic movie\u0085.<br /><br />I almost didn't finish watching this bad movie,but it will be unfair of me to write a review without watching the complete movie.<br /><br />Trust me when I say \" this movie sucks\" I am truly shocked that some bad filmmaker wane bee got even financed to make this pathetic movie, But it couldn't have cost more than $20 000 to produce this movie. all you need are a cheap camcorder or a cell phone camera .about 15 people with no acting skills, a scrip that were written by a couple of drunk people.<br /><br />In the fist part of this ultra bad move a reporter (Tara Woodley )run a suppose to be drunk man over on her way to report on a hunted town. He are completely unharmed. They went to a supposed to be abandon house ,but luckily for the it almost complete furnished and a bottle of liquor on the door step happens to be there. just for the supposed to be drunk man but all is not what it seems.<br /><br />Then the supposed drunk man start telling Tara ghost/zombies stories.<br /><br />The fist of his stupid lame stories must be the worst in history.<br /><br />his story<br /><br />Sgt. Ben Draper let one of his soldiers die of complete exhaustion (I think this is what happens)after letting the poor soldier private Wilson do sit ups he let him dig a grave and then the soldier collapse ,Ben Draper<br /><br />buries him in a shallow grave.<br /><br />But Sgt. Ben Draper are in for n big surprise. his wife/girl fiend knows about this and she and her lover kills Sgt. Ben Draper to take revenge on private Wilson.(next to the grave of the soldier he sort off murdered) The soldier wakes up from his grave in the form of zombie and kill them for taking revenge on his behalf.<br /><br />The twist ending were so lame.<br /><br />Even if you like B HORROR movies, don't watch this movie", "LBL": "negative"}
{"TEXT1": "I have not seen many low budget films i must admit, but this is the worst movie ever probably, the main character the old man talked like, he had a lobotomy and lost the power to speak more than one word every 5 seconds, a 5 year old could act better. The story had the most awful plot, and well the army guy had put what he thought was army like and then just went over the top, i only watched it to laugh at how bad it was, and hoped it was leading onto the real movie. I cant believe it was under the 2 night rental thing at blockbusters, instead of a please take this for free and get it out of our sight. I think there was one semi decent actor other than the woman, i think the only thing OK with the budget was the make up, but they show every important scene of the film in the beginning music bit. Awful simply awful.", "LBL": "negative"}
{"TEXT1": "..Oh wait, I can! This movie is not for the typical film snob, unless you want to brush up on your typical cinematic definitions, like \"continuity editing\" and \"geographic match\". I couldn't tell where I was in this movie. One second they're in the present, next minute their supposedly in the 70's driving a modern SUV and wearing what looked like to me as 80's style clothing. I think. I couldn't pay long enough attention to it since the acting was just horrible. I think it only got attention because it has a 3d which I did not watch. If you're a b-movie buff, and by b-movie I mean BAD movie, then this film is for you. It's home-movie and all non-sense style will keep you laughing for as long as you can stay awake. If your tastes are more for Goddard and Antonioni, though, just skip this one.", "LBL": "negative"}
{"TEXT1": "You have to admire Brad Sykes even if you don't particularly want to, a man who churns out budget horror after budget horror to less than enthusiastic receptions. But keeps on doing it all the same. Even the half-hearted praise than surrounds his Camp Blood films is given grudgingly and I'm as guilty of this as anyone. Brad normally manages to throw something interesting into the mix, a neat idea, a kooky character, whatever, but without the funds to take it further than base level, he relies on the audience to cut him some slack and appreciate it for what it is and what it could be. Joe Haggerty gives a spirited and very funny performance as Ebenezer Jackson and its a credit to Sykes that he can sense that this oddball turn is going to work within the framework of the film. Coming to a multiplex near you, in a parallel universe, somewhere.", "LBL": "negative"}
{"TEXT1": "THE ZOMBIE CHRONICLES <br /><br />Aspect ratio: 1.33:1 (Nu-View 3-D)<br /><br />Sound format: Mono<br /><br />Whilst searching for a (literal) ghost town in the middle of nowhere, a young reporter (Emmy Smith) picks up a grizzled hitchhiker (Joseph Haggerty) who tells her two stories involving flesh-eating zombies reputed to haunt the area.<br /><br />An ABSOLUTE waste of time, hobbled from the outset by Haggerty's painfully amateurish performance in a key role. Worse still, the two stories which make up the bulk of the running time are utterly routine, made worse by indifferent performances and lackluster direction by Brad Sykes, previously responsible for the likes of CAMP BLOOD (1999). This isn't a 'fun' movie in the sense that Ed Wood's movies are 'fun' (he, at least, believed in what he was doing and was sincere in his efforts, despite a lack of talent); Sykes' home-made movies are, in fact, aggravating, boring and almost completely devoid of any redeeming virtue, and most viewers will feel justifiably angry and cheated by such unimaginative, badly-conceived junk. The 3-D format is utterly wasted here.", "LBL": "negative"}
{"TEXT1": "A woman asks for advice on the road to reach a mysterious town, and hears two ghoulish stories from the local weirdo, both zombie related. But perhaps fate has something nasty in store for her too...<br /><br />The Zombie Chronicles is absolutely one of the worst films I have ever seen. In fact I must confess, so bad was it I fast forwarded through most of the garbage. And there was a lot of that, believe me. It runs for just 69 minutes, and there is still tons of filler. You get some skinhead doing a lot of push ups, plenty of dull kissy-kissy scenes between goofy teens (that rhymed, tee hee) and some fine examples of why some people should never become actors.<br /><br />As for the title characters, they barely even have a footnote in the film. Why, you get more undead action in the intro than you do the preceding feature! Though, considering how pathetic the eyes bursting out of sockets and the eating of brains sequences are (amongst other 'delights'), maybe that's a blessing in disguise.<br /><br />And to top it all off, it looks likes it's been filmed on someone's mobile phone for broadcast on Youtube. Jerky camera-work, scratches on the print, flickering lights... I had to rub my eyes when I realised it was made in 2001, and not 1971. Even the clothes and fashioned look about three decades out of date!<br /><br />If you think I'm not qualified to do a review of Chronicles having not seen the whole film, then go ahead. YOU try sitting through it, I betcha you won't even make it to the first appearance of the blue-smartie coloured freaks before making your excuses and leaving. It is truly laughable that anyone chose to release it, and honestly you'll get far more fun resting your drink on the disc than actually torturing your DVD player with this gigglesome excuse for horror. In fact, don't for surprised if it packs it's bags and leaves in the morning, leaving you doomed to watch VHS tapes for the rest of your life. You have been warned... 0/10<br /><br />P.S What kind of 18-rated horror has the woman keep a massive sports bra on during the obligatory sex scene?! See, the movie can't even get that part right...", "LBL": "negative"}
{"TEXT1": "Really, I can't believe that I spent $5 on this movie. I am a huge zombie fanatic and thought the movie couldn't be that bad. It had zombies in it right? Was I wrong! To be honest the movie had it's moments...I thought it was cool when the guy got his head ripped off but that was about it. Overall I think that it would be more enjoyable to slide down a razorblade slide on my bare nutsack into a vat of vinegar then watch this movie again. The movie could have been better if we could see some boob but I had to watch the trailers for the other movies produced by this company to see that. Buyer beware...unless you are into masochism.", "LBL": "negative"}
{"TEXT1": "I rented this movie about 3 years ago, and it still stands out in my mind as the worst movie ever made. I don't think I ever finished it. It is worse than a home video made by a high school student. I remember them doing a flashback to 1970 something and in the flashback there was a man with a polo shirt, oakley sunglasses and a newer SUV, like a Toyota Rav-4 or something (I don't remember). I don't understand how they could have possibly said that to be in the 70s. He might have had a cell phone too, I cant remember, It was just horrible. I returned it to the video store and asked them why they even carry the movie and if I could get the hour of my life back. To this day it is the worst movie I have ever seen, and I have seen some pretty bad ones.", "LBL": "negative"}
{"TEXT1": ":Spoilers:<br /><br />I was very disappointed in Love's Abiding Joy. I had been waiting a really long time to see it and I finally got the chance when it re-aired Thursday night on Hallmark. I love the first three \"Love\" movies but this one was nothing like I thought it was going to be. The whole movie was sad and depressing, there were way to many goofs, and the editing was very poor - to many scenes out of context. I also think the death of baby Kathy happened way to soon and Clarks appearance in the movie just didn't seem to fit. It seemed like none of the actors really wanted to be there - they were all lacking emotion. There seemed to be no interaction between Missie and Willie at all.<br /><br />I think the script writers should have went more by the book. It seems like every movie that's been made so far just slips further and further away from Janette Oke's writings. I mean in the movie they never mentioned a thing about the mine and the two boys or Clark getting hurt because of it. And I think Missie and Willies reactions to Kathy's death could have been shown and heard rather than just heard.<br /><br />Out of the four movies that have been made so far I'd have to say that Love's Abiding Joy is my least favorite. I hope with the next four movies that more of the book is followed and if Clarks character is in them I hope he's got a bigger part and I hope his part isn't so bland. I also hope there is more of Scottie and Cookie and maybe even Marty but who knows what the script writers will have in store next.", "LBL": "negative"}
{"TEXT1": "I've seen all four of the movies in this series. Each one strays further and further from the books. This is the worst one yet. My problem is that it does not follow the book it is titled after in any way! The directors and producers should have named it any thing other than \"Love's Abiding Joy.\" The only thing about this movie that remotely resembles the book are the names of some of the characters (Willie, Missie, Henry, Clark, Scottie and Cookie). The names/ages/genders of the children are wrong. The entire story line is no where in the book.<br /><br />I find it a great disservice to Janette Oke, her books and her fans to produce a movie under her title that is not correct in any way. The music is too loud. The actors are not convincing - they lack emotions.<br /><br />If you want a good family movie, this might do. It is clean. Don't watch it, though, if you are hoping for a condensed version of the book. I hope that this will be the last movie from this series, but I doubt it. If there are more movies made, I wish Michael Landon, Jr and others would stick closer to the original plot and story lines. The books are excellent and, if closely followed, would make excellent movies!", "LBL": "negative"}
{"TEXT1": "I very much looked forward to this movie. Its a good family movie; however, if Michael Landon Jr.'s editing team did a better job of editing, the movie would be much better. Too many scenes out of context. I do hope there is another movie from the series, they're all very good. But, if another one is made, I beg them to take better care at editing. This story was all over the place and didn't seem to have a center. Which is unfortunate because the other movies of the series were great. I enjoy the story of Willie and Missy; they're both great role models. Plus, the romantic side of the viewers always enjoy a good love story.", "LBL": "negative"}
{"TEXT1": "I have read all of the Love Come Softly books. Knowing full well that movies can not use all aspects of the book,but generally they at least have the main point of the book. I was highly disappointed in this movie. The only thing that they have in this movie that is in the book is that Missy's father comes to visit,(although in the book both parents come). That is all. The story line was so twisted and far fetch and yes, sad, from the book, that I just couldn't enjoy it. Even if I didn't read the book it was too sad. I do know that Pioneer life was rough,but the whole movie was a downer. The rating is for having the same family orientation of the film that makes them great.", "LBL": "negative"}
{"TEXT1": "As a Southern Baptist, it pains me that I must give a below average rating to an overtly Christian movie. There certainly aren't so many that I want to discourage film-makers from a genre that's woefully under-exploited. Still, I must honestly say that \"Love's Abiding Joy\" is a typically low budget, low key, self-consciously Christian film. The plot is predictable, the acting mediocre (I'm being kind), and the editing atrocious. As a TV movie it might have been slightly above average, but as a feature film it leaves much to be desired. Keep trying guys. You've got to have a movie about about real Christians inside you somewhere. Might I suggest you turn to G. K. Chesterton or C. S. Lewis for some inspiration?", "LBL": "negative"}
{"TEXT1": "WARNING: This review contains SPOILERS. Do not read if you don't want some points revealed to you before you watch the film.<br /><br />With a cast like this, you wonder whether or not the actors and actresses knew exactly what they were getting into. Did they see the script and say, `Hey, Close Encounters of the Third Kind was such a hit that this one can't fail.' Unfortunately, it does. Did they even think to check on the director's credentials? I mean, would YOU do a movie with the director of a movie called `Satan's Cheerleaders?' Greydon Clark, who would later go on to direct the infamous `Final Justice,' made this. It makes you wonder how the people of Mystery Science Theater 3000 could hammer `Final Justice' and completely miss out on `The Return.'<br /><br />The film is set in a small town in New Mexico. A little boy and girl are in the street unsupervised one night when a powerful flashlight beam.er.a spaceship appears and hovers over them. In probably the worst special effect sequence of the film, the ship spews some kind of red ink on them. It looked like Clark had held a beaker of water in from of the camera lens and dipped his leaky pen in it, so right away you are treated with cheese. Anyhow, the ship leaves and the adults don't believe the children. Elsewhere, we see Vincent Schiavelli, whom I find to be a terrific actor (watch his scenes in `Ghost' for proof, as they are outstanding), who is playing a prospector, or as I called him, the Miner 1949er. He steps out of the cave he is in, and he and his dog are inked by the ship. Twenty-five years go by, and the girl has grown up to be Cybill Shepherd, who works with her father, Raymond Burr, in studying unusual weather phenomena. Or something like that. Shepherd spots some strange phenomena in satellite pictures over that little New Mexico town, and she travels there to research it. Once she gets there, the local ranchers harass her, and blame her for the recent slew of cattle mutilations that have been going on, and deputy Jan-Michael Vincent comes to her rescue. From this point on, the film really drags as the two quickly fall for each other, especially after Vincent wards off the locals and informs Shepherd that he was the little boy that saw the ship with her twenty-five years earlier. While this boring mess is happening, Vincent Schiavelli, with his killer dog at his side, is walking around killing the cattle and any people he runs into with an unusual item. You know those glowing plastic sticks stores sell for trick-or-treaters at Halloween, the kind that you shake to make them glow? Schiavelli uses what looks like one of those glow sticks to burn incisions in people. It's the second-worst effect in the movie. Every time Schiavelli is on screen with the glow stick, the scene's atmosphere suddenly turns dark, like the filmmakers thought the glow stick needed that enhancement. It ends up making the movie look even cheaper than it is.<br /><br />And what does all this lead up to? It's hard to tell when the final, confusing scene arrives. See, Burr and his team of scientists try to explain the satellite images that Shepherd found as some kind of `calling card,' but none of it makes sense. Why do Shepherd and Vincent age and Schiavelli does not? Schiavelli explains why he is killing cattle and people and why he wants Shepherd dead, but even that doesn't make much sense when you really think about it. I mean, why doesn't he kill Jan-Michael Vincent? After all, he had twenty-five years to do it. And the aliens won't need him if Shepherd is dead anyhow, so why try to kill her? Speaking of the aliens, it is never clear what they really wanted out of Shepherd and Vincent. What is their goal? Why do they wait so long to intervene? How could they be so sure Shepherd would come back? Not that the answer to any of these and other questions would have made `The Return' any more pleasant. You would still have bad lines, really bad acting, particularly by Shepherd, cheesy effects, and poor direction. Luckily, the stars escaped from this movie. Cybill Shepherd soon went on to star in `Moonlighting' with Bruce Willis. Jan-Michael Vincent went on to be featured in dozens of B-movies, often in over-the-top parts. Raymond Burr made a pile of Perry Mason television movies right up until his death. Vincent Schiavelli went on to be a great character actor in a huge number of films. Martin Landau, who played a kooky law enforcement officer, quickly made the terrific `Alone in the Dark' and the awful `The Being' before rolling into the films he has been famous for recently. You can bet none of these stars ever want their careers to return to `The Return.' Zantara's score: 2 out of 10.", "LBL": "negative"}
{"TEXT1": "As a kid I did think the weapon the murderer wielded was cool, however I was a kid and so I was a bit dumb. Even as a dumb kid though the movies plot was stupid and a bit boring when the killer was not using his light knife to kill people. What amazes me is that the movie has a really solid cast in it. What script did they read when agreeing to be in this movie as it is most assuredly boring and only a means to show off a light saber on a very small scale. The plot at times is incomprehensible and the end is totally chaotic. The whole film seems to rotate around aliens and the one weapon. The plot has two kids and some dude having an alien encounter, flash years later and there seems to be a return as it were in the mix. Dead animals and such to be explored and for some reason the one dude gets the weapon of the aliens and proceeds to use it to go on a very light killing spree. Seriously, you just have to wonder why this movie was made, if you are going to have a killer have some good death scenes, if you are going to have alien encounters show more than a weird light vortex thing, and if you are going to have light sabers then call yourself star wars.", "LBL": "negative"}
{"TEXT1": "Jill Dunne (played by Mitzi Kapture), is an attractive, nice woman, over-whelmed by a smart-mouthed teenage daughter, Liv (Martha MacIsaac) and a petty, two-timing husband, Sean (Rick Roberts), both of which were tediously self-centered, and obnoxious.<br /><br />This was advertised as a troubled family stalked by a crazed killer during a relentless storm.<br /><br />The storm doesn't even happen until about the last 5 minutes of the film, and then it isn't anything to send anybody running to the storm cellar.<br /><br />The stalking, likewise doesn't get intense until almost the end of the film.<br /><br />Most of the film we spend listening to Jill and her insufferable daughter, Liv, argue until I just wanted to back slap the daughter into next week.<br /><br />Jill's problem with Liv is that she has taken up with Zack, a boy of questionable character, and they are constantly making out--in fact Jill comes home to find the two of them on Liv's bed.<br /><br />The rest of the time we spend listening to Jill's husband Sean either whine at Jill or criticize her.<br /><br />Sean was not at all appealing--since his face is so covered in freckles you could play connect the dots.<br /><br />The story begins with Jill being notified of an out-standing bill on their credit card for a hotel she has never been to, and that she thought Sean had never been to either.<br /><br />Jill goes to the hotel where she meets the owner & manager, Richard Grant (Nick Mancuso), a very nice, older, divorced man, who is sympathetic to her. In fact, when he spots her husband there again, he phones Jill and tips her off.<br /><br />Jill returns to the hotel, sees Sean with another woman. She is upset, leaves without Sean seeing her, and does absolutely nothing. In fact, she doesn't even say anything to Sean when he arrives home. This made no sense to me.<br /><br />Jill has given Richard her business card, and so he calls her and she is apparently in real estate. She shows him a condo. Afterwards they have a drink, and things get cozy between them.<br /><br />Richard and Jill are getting it on, hot and heavy. In fact, he seems a bit more aggressive than necessary, when Jill suddenly decides to cut out.<br /><br />Jill and Sean have a confrontation about his cheating. Sean whines about how Jill has been letting him down since her father died. Apparently his lack of any morals is all her fault. Eventually Jill confesses her own lack of morals and near adultery to Sean--and of course that's all her fault too, as far as Sean is concerned.<br /><br />The little family decides to go on a camping trip--which means more whining and grousing among them, especially from the spoiled daughter.<br /><br />I was so rooting for the stalker to get everybody, but Jill.<br /><br />3 stars", "LBL": "negative"}
{"TEXT1": "This movie sucked. It really was a waste of my life. The acting was atrocious, the plot completely implausible. Long, long story short, these people get \"terrorized\" by this pathetic \"crazed killer\", but completely fail to fight back in any manner. And this is after they take a raft on a camping trip, with no gear, and show up at a campsite that is already assembled and completely stocked with food and clothes and the daughters headphones. Additionally, after their boat goes missing, they panic that they're stuck in the woods, but then the daughters boyfriend just shows up and they apparently never consider that they could just hike out of the woods like he did to get to them. Like I said, this movie sucks. A complete joke. Don't let your girlfriend talk you into watching it.", "LBL": "negative"}
{"TEXT1": "Lifetime did it again. Can we say stupid? I couldn't wait for it to end. The plot was senseless. The acting was terrible! Especially by the teenagers. The story has been played a thousand times! Are we just desperate to give actors a job? The previews were attractive and I was really looking for a good thriller.Once in awhile lifetime comes up with a good movie, this isn't one of them. Unless one has nothing else to do I would avoid this one at all cost. This was a waste of two hours of my life. Can I get them back? I would have rather scraped my face against a brick wall for two hours then soaked it in peroxide. That would have been more entertaining.", "LBL": "negative"}
{"TEXT1": "I have to say I am really surprised at the high ratings for this movie. I found it to be absolutely idiotic. The mother gets \"visions\" when she touches certain things or people? And one thing she touched twice made her vision continue... Just seemed so ridiculous. Deedee Pfieffer's performance was awful I thought. She was very irritating. The girl who played Lori did a good job and so did most of the supporting cast for what they had to work with.<br /><br />I usually love LMN and am very open minded when it comes to movies but this movie seemed to have a ridiculous plot and over the top acting and it just was not for me.", "LBL": "negative"}
{"TEXT1": "The original book of this was set in the 1950s but that won't do for the TV series because most people watch for the 1930s style. Ironically the tube train near the end was a 1950s train painted to look like a 1930s train so the Underground can play at that game too. Hanging the storyline on a plot about the Jarrow March was feeble but the 50s version had students who were beginning to think about the world around them so I suppose making them think about the poverty of the marchers is much the same thing. All the stuff about Japp having to cater for himself was weak too but they had to put something in to fill the time. This would have made a decent half hour show or they could have filmed the book and made it a better long show. It is obvious this episode is a victim of style over content.", "LBL": "negative"}
{"TEXT1": "The annoying mouse and lullaby really got to me and really had nothing to do with the story...It's something I would have done my 1st year in film school. Very sad. Additionally, the story just seemed to drag on for no apparent reason...there were too many things just thrown in there that had nothing to do with the story, which makes me feel that the creative team didn't really know what they were doing, or just that it should have been shorter...which would have been a blessing, not a crime. As I have just watched all of the episodes up to this point over the past week...I'd have to say that this was by far the worst, and I just wanted to warn others not to start with this one.", "LBL": "negative"}
{"TEXT1": "I saw this film opening weekend in Australia, anticipating with an excellent cast of Ledger, Edgerton, Bloom, Watts and Rush that the definitive story of Ned Kelly would unfold before me. Unfortunately, despite an outstanding performance by Heath Ledger in the lead role, the plot was paper thin....which doesn't inspire me to read \"Our Sunshine\". There were some other plus points, the support acting from Edgerton in particular, assured direction from Jordan (confirming his talent on show in Buffalo Soldiers as well), and production design that gave a real feel of harshness to the Australian bush, much as the Irish immigrants of the early 19th century must have seen it. But I can't help feeling that another opportunity has been missed to tell the real story of an Australian folk hero (or was he?)....in what I suspect is a concession to Hollywood and selling the picture in the US. Oh well, at least Jordan and the producers didn't agree to lose the beards just to please Universal...<br /><br />Guess I will just have to content myself with Peter Carey's excellent \"Secret History of the Kelly Gang\". 4/10", "LBL": "negative"}
{"TEXT1": "I saw this at the premiere in Melbourne<br /><br />It is shallow, two-dimensional, unaffecting and, hard to believe given the subject matter, boring. The actors are passable, but they didn't have much to work with given the very plodding and unimpressive script. For those who might have worried that Ned Kelly would be over-intellectualised, you can take comfort in the fact that this telling of the story is utterly without any literary depth at all, told entirely on the surface and full of central casting standards. However, it doesn't work as a popcorn film either. Its pacing is too off-kilter and its craft is too lacking to satisfy even on the level of a mundane actioner.<br /><br />I very much doubt Gregor Jordan could sit back and say to himself \"this is the best I could have done with the material\".<br /><br />Ned Kelly is a fascinating figure, and equally so is the national response to him. Possibly folk genius, possibly class warrior, possibly psychopath and probably all these things, he has dominated Australian true mythology for over 120 years. Once again, his story has failed miserably on the big screen.<br /><br />Such is life.", "LBL": "negative"}
{"TEXT1": "Ned Kelly (Ledger), the infamous Australian outlaw and legend. Sort of like Robin Hood, with a mix of Billy the Kid, Australians love the legend of how he stood up against the English aristocratic oppression, and united the lower classes to change Australia forever. The fact that the lower classes of the time were around 70% immigrant criminals seems to be casually skimmed around by this film. Indeed, quite a few so called `facts' in this film are, on reflection, a tad dubious.<br /><br />I suppose the suspicions should have been aroused when, in the opening credits, it was claimed that this film is based upon the book, `Our Sunshine'. If ever a romanticized version of truth could be seen in a name for a book, there it was. This wasn't going to be a historical epic, but just an adaptation of one of many dubious legends of Ned Kelly, albeit a harsh and sporadically brutal version.<br /><br />Unfortunately, Ned Kelly is nothing more than an overblown Hallmark channel `real life historical drama' wannabe! The story plods along at an alarming rate (alarming because never has a film plodded so slowly!) The feeling of numbness after the two hours of pure drivel brought back memories of Costner's awful Wyatt Earp all those years ago. Simply put, nothing happens in the film, but it takes a long time getting to that nothing. This would possibly have been a tad more bearable if the performances were good (because the direction sure as heck wasn't). However, unless you are looking to play a game of spot the worst Oirish accent, then you're gonna be disappointed. Between that, the game of `Who has the stupidest beard?', `Spot the obvious backstabber!' (clue, they are all ginger for some reason), and `Nature in Australia.including lions', it is an experience similar to flicking through Hallmark, The History Channel, Discovery Channel, and Neighbours whilst suffering a huge hangover. Yup, nature pops up a lot, as to fill even more time (possibly an attempt to look arty), the film keeps showing pointless wildlife shots, and once all the native species are shown, here's a circus to allow for a camel and a lion (which is used during one fight to try to make us actually feel more sorry for the lion than the massacred people).<br /><br />This is a turgid, emotionless piece of historical fluff which should have gone straight to TV. There isn't even one good word I can say about this film. Even the usually fantastic Rush seems embarrassed to be here. When one of the characters comments that there is only 2 bullets left for him and his pal, I myself was wishing I had a gun to blow any memory of this film out of my head!", "LBL": "negative"}
{"TEXT1": "They constructed this one as a kind of fantasy Man From Snowy River meets Butch Cassidy and the Sundance kid, and just for a romantic touch Ned and Joe get to play away with high class talent, the bored young wives of wealthy older men. OK, there are lots of myths about Ned Kelly, but there are also a lot of well documented facts, still leaving space for artistic creativity in producing a good historical dramaticisation. I mean, this is not the Robin Hood story, not the Arthurian legends, not Beowulf, not someone whose life is so shrouded in the mists of many many centuries past that any recreation of their life and times is 99% guesswork. It's only a couple of lifetimes ago. My own grandparents were already of school age when Ned was hanged. <br /><br />So it's silly me for fancifully imagining this movie was a serious attempt to tell the Kelly story. Having recently read Peter Carey's excellent novel \"The True History of the Kelly Gang\" I had eagerly anticipated that this would be in similar vein. But no, the fact is that Mick Jagger's much derided 1970 Kelly was probably far closer to reality, and a better movie overall, which isn't saying a whole lot for it.<br /><br />Glad it only cost me two bucks to hire the DVD! I'll give it 3/10, and that's only because some of the nice shots of the Australian bush make me feel generous.", "LBL": "negative"}
{"TEXT1": "This has to be the worst piece of garbage I've seen in a while.<br /><br />Heath Ledger is a heartthrob? He looked deformed. I wish I'd known that he and Naomi Watts are an item in real life because I spent 2 of the longest hours of my life wondering what she saw in him. <br /><br />Orlando Bloom is a heartthrob? With the scraggly beard and deer-in-the-headlights look about him, I can't say I agree.<br /><br />Rachel Griffiths was her usual fabulous self, but Geoffrey Rush looked as if he couldn't wait to get off the set. <br /><br />I'm supposed to feel sorry for bankrobbers and murderers? This is a far cry from Butch Cassidy, which actually WAS an entertaining film. This was trite, cliche-ridden and boring. We only stayed because we were convinced it would get better. It didn't.<br /><br />The last 10-15 minutes or so were unintentionally hilarious. Heath and his gang are holed up in a frontier hotel, and women and children are dying because of their presence. That's not funny. But it was funny when they walked out of the hotel with the armor on, because all we could think of was the Black Knight from Monty Python and the Holy Grail. I kept waiting for them to say \"I'll bite yer leg off!\" We were howling with laughter, as were several other warped members of the audience. When we left, pretty much everyone was talking about what a waste of time this film was.<br /><br />I may not have paid cash to see this disaster (sneak preview), but it certainly wasn't free. It cost me 2 hours of my life that I will never get back.", "LBL": "negative"}
{"TEXT1": "If the term itself were not geographically and semantically meaningless, one might well refer to \"Ned Kelly\" as an \"Australian Western.\" For the people Down Under, Ned Kelly was, apparently, a folk hero bandit akin to Robin Hood, Jesse James, Bonnie and Clyde, and Butch Cassidy and the Sundance Kid. The descendant of Irish immigrants, Kelly became a fugitive and an outlaw after he was falsely accused of shooting an Australian law officer, a crime for which his equally innocent mother was put into prison. To get back at the government for this mistreatment, Kelly, his brother Dan, and two other companions, became notorious bank robbers, winning over the hearts of many people in the countryside while striking a blow for justice in a land where Irish immigrants were often treated with disrespect and disdain by those who ran the country.<br /><br />Perhaps because we've encountered this \"gentleman bandit\" scenario so many times in the past, \"Ned Kelly\" feels awfully familiar and unoriginal as it pays homage to any number of the genre's stereotypes and clichés on its way to the inevitable showdown. Ned is the typical heart-of-gold lawbreaker who kills only when he is forced to and, even then, only with the deepest regret. He also has the pulse of the common folk, as when, in the middle of a bank robbery, he returns a valuable watch to one of the customers, after one of his gang has so inconsiderately pilfered it. What movie on this particular subject hasn't featured a scene like that? It's acts of selective generosity like this, of course, that earn him the love and respect of all the little people who come to secretly admire anyone who can get away with sticking it to the powers-that-be and the status quo. Geoffrey Rush plays the typical bedeviled law enforcer who feels a personal stake in bringing down this upstart troublemaker who keeps getting away with tweaking the establishment. There's even the inevitable episode in which one of the ladies being held up goes into the next room and has sex with one of the robbers, so turned on is she by the romantic derring-do of the criminal lifestyle. And the film is riddled with one hackneyed scene like this after another.<br /><br />Heath Ledger fails to distinguish himself in the title role, providing little in the way of substance to make his character either interesting or engaging. It doesn't help that he has been forced to provide a droning voice-over narration that underlines the sanctimoniousness and pretentiousness of both the character and the film.<br /><br />\"Ned Kelly\" might serve a function of sorts as a lesson in Australian history, but as an entertainment, it's just the same old story told with different accents.", "LBL": "negative"}
{"TEXT1": "This movie was so unrelentingly bad, I could hardly believe I was watching it. The directing, editing, production, and script all seemed as though they had been done by junior high school students who don't know all that much about movies. There was no narrative flow that made any sort of sense. Big emotional moments and climaxes (like one early on between Heath Ledger and Naomi Watts) and character relationships (like one hinted at at the very beginning) come completely out of no where and are not set up like they would have been in a more elegantly and effectively made film. The characters are sadly underdeveloped, making it difficult for us to have any sort of connection with them. The acting, surprisingly, is not entirely bad, but the terrible writing cancels out the relatively convincing performances. The film plays like a particularly bad T.V. western/epic, and sadly diminishes the fascinating (true) story that it attempts to tell. I have read a lot of reviews that defend the film as being important to Australians because of the subject matter. That's all very well, but just because Ned Kelly is an important Australian historical icon DOESN'T MAKE THE MOVIE GOOD. No one is saying that the subject matter isn't good, just the quality of the movie itself. Pearl Harbor was about a very important historical event to Americans, but that doesn't mean I'm going to defend the movie and say it was good, because it was still bad. A failure all around, though Heath and Orlando are lovely to look at.", "LBL": "negative"}
{"TEXT1": "This movie never made it to theaters in our area, so when it became available on DVD I was one of the first to rent it. For once, I should listened to the critics and passed on this one.<br /><br />Despite the excellent line up of actors the movie was very disappointing. I can see now why it went straight to video. <br /><br />I had thought that with Bloom, Ledger, and Rush it could have some value. All have done wonderful work in the past. <br /><br />The movie was slow moving and never pulled me in. I failed to develop much empathy for the characters and had to fight the urge to fast-forward just to get to the end. <br /><br />I do not recommend this film even if you are thinking of renting it for only for 'eye candy' purposes. It won't satisfy even that.", "LBL": "negative"}
{"TEXT1": "I thought this was a very clunky, uninvolving version of a famous Australian story. Heath Ledger and Orlando Bloom were very good in their roles, and gave their characters some personality; but the whole thing felt forced and mechanical.<br /><br />The beginning could have been a lot more involving; perhaps starting with a shootout, and then flashing back for a recap of how they got there or that sort of thing. And I felt like every scene was routinely predictable and signposted, like a very bad tv soap.<br /><br />I was really looking forward to this movie, and hoping for something a lot better. The only thing I can say in its favour is that it beats the Mick Jagger version, but not by much.", "LBL": "negative"}
{"TEXT1": "Ned aKelly is such an important story to Australians but this movie is awful. It's an Australian story yet it seems like it was set in America. Also Ned was an Australian yet he has an Irish accent...it is the worst film I have seen in a long time", "LBL": "negative"}
{"TEXT1": "From the very beginning, the political theme of this film is so obvious and heavy handed, that the outcome is entirely predictable. Any good textbook on writing screenplays will advise layering of characters, incorporating character arcs, and three act structure. In this film you will find none of that. The police are the baddies, and consequently are shown as shallow, incompetent and cowards. It never seems to occur to the makers of this film that police might be honourable citizens who see joining the police as a good way to contribute to the wellbeing of society.<br /><br />The viewer gets no opportunity to make up his or her mind on whether Ned Kelly is a good guy or a ruthless villain. The film opens with him being arrested for stealing a horse, but we get no clue as to his guilt or innocence. We see him walk through the door of a gaol, but only know that he has been inside for three years when we hear this much later in some dialogue.<br /><br />This film contains many shots of Ned looking at the camera with a serious expression. I found the film a real chore to watch. It is the direction for modern films, and this one put me off watching any more.", "LBL": "negative"}
{"TEXT1": "I guess I was attracted to this film both because of the sound of the story and the leading actor, so I gave it a chance, from director Gregor Jordan (Buffalo Soldiers). Basically Ned Kelly (Heath Ledger) is set up by the police, especially Superintendent Francis Hare (Geoffrey Rush), he is forced to go on the run forming a gang and go against them to clear his own and his family's names. That's really all I can say about the story, as I wasn't paying the fullest attention to be honest. Also starring Orlando Bloom as Joseph Byrne, Naomi Watts as Julia Cook, Laurence Kinlan as Dan Kelly, Philip Barantini as Steve Hart, Joel Edgerton as Aaron Sherritt, Kiri Paramore as Constable Fitzpatrick, Kerry Condon as Kate Kelly, Emily Browning as Grace Kelly and Rachel Griffiths as Susan Scott. Ledger makes a pretty good performance, for what it's worth, and the film does have it's eye-catching moments, particularly with a gun battle towards the end, but I can't say I enjoyed it as I didn't look at it all. Okay!", "LBL": "negative"}
{"TEXT1": "I don't quite get the rating for The Amati Girls and I think I was REALLY kind giving it a 4 out of 10. What could otherwise have been a wonderful story with actually a set of more or less decent actors became a total farce in my eyes. There are so many clichés in that flick, the women's hair is just awful and most of the scenes are more than unrealistic or seem fake. There's no real passion in this movie but a bunch of actors over-acting over any limits that it hurts. It's not funny enough to be a comedy, it's too fake-sad to really touch, so in my eyes it's just not good. Watching it I couldn't believe how something like that made it to my TV set in my living room in Switzerland. But.. maybe it still was OK and it just got lost in translation? Who knows. Definitely one of the oddest movies I've ever seen and this certainly not in a good way! Sorry.", "LBL": "negative"}
{"TEXT1": "This movie was awful. The ending was absolutely horrible. There was no plot to the movie whatsoever. The only thing that was decent about the movie was the acting done by Robert DuVall and James Earl Jones. Their performances were excellent! The only problem was that the movie did not do their acting performances any justice. If the script would have come close to capturing a halfway decent story, it would be worth watching. Instead, Robert DuVall's and James Earl Jones' performances are completely wasted on a god awful storyline...or lack thereof. Not only was I left waiting throughout the movie for something to happen to make the movie....well an actual movie...not just utterless dialog between characters for what ended up being absolutely no reason. It was nothing more than common dialog that would have taken place back in that period of time. There was nothing special about any of the characters. The only thing special was how Robert DuVall portrayed a rambling, senile, drunk, old man. Nothing worthy happens during the entire movie including the end. When the movie ended, I sat amazed...amazed that I sat through the entire movie waiting for something of interest to happen to make watching the movie worth while. It never happened! The cast of characters suddenly started rolling making it apparent that the movie really was over and I realized that I had just wasted 2 hours of my life watching a movie with absolutely no plot and no meaning. It wasn't even a story. The entire movie takes place in a day's worth of time. That's it. It was one day in the life (and death) of some Southerners on a plantation. How much of a story can take place in a single day (other than the movie Training Day)? The acting performances by the entire cast were excellent, but they were grossly wasted on such a disappointment of a movie...if you can even call it a movie.", "LBL": "negative"}
{"TEXT1": "Holy crap. This was the worst film I have seen in a long time. All the performances are fine, but there is no plot. Really! No plot! A bunch of clowns talk about this and that and that's your film. Ug... Robert Duvall's character is senile and keeps asking the same people the same qestions over and over. This earns him the same responses over and over. I am pretty sure this film got upto a six because people think they should like it. Good performances with famous and well regarded actors, but the actual complete work is a steamy turd. Well, maybe that's a bit deceptive since steam rising from a fresh pile sounds a little like something happening and in this film NOTHING HAPPENS! Sack", "LBL": "negative"}
{"TEXT1": "SWING! is an important film because it's one of the remaining Black-produced and acted films from the 1930s. Many of these films have simply deteriorated so badly that they are unwatchable, but this one is in fairly good shape. It's also a nice chance to see many of the talented Black performers of the period just after the heyday of the old Cotton Club--a time all but forgotten today.<br /><br />Unfortunately, while the film is historically important and has some lovely performances, it's also a mess. The main plot is very similar to the Hollywood musicals of the era--including a prima donna who is going to ruin the show and the surprise unknown who appears from no where to save the day. However, the writing is just god-awful and a bit trashy at times--and projects images of Black America that some might find a bit demeaning. This is because before the plot really gets going, you are treated to a no-account bum who lives off his hard working wife (a popular stereotype of the time) and when he is caught with a hussy (who, by the way, totally overplays this role), they have a fight which looks like a scene from WWE Smackdown! And, the one lady wants to cut the other lady with a straight razor--a trashy scene indeed! Later in the film, when the prima donna is behaving abominably, her husband punches her in the face and everyone applauds him! It seems like the film, at times, wants to appeal to the lowest common denominator in the audience PLUS they can't even do this well--with some of the worst acting I've seen in a very long time.<br /><br />Still, if you can look past a lousy production in just about every way (with trashy characters, bad acting and direction and poor writing), this one might be worth a peek so you can see excellent singing and tap dancing--as well as to catch a glimpse of forgotten Black culture. Just don't say I didn't warn you about the acting--it's really, really bad!", "LBL": "negative"}
{"TEXT1": "There's not a drop of sunshine in \"The Sunshine Boys\", which makes the title of this alleged comedy Neil Simon's sole ironic moment. Simon, who adapted the script from his play (which goes uncredited), equates old age with irrational behavior--and, worse, clumsy, galumphing, mean-spirited irrational behavior. Walter Matthau is merciless on us playing an aged vaudeville performer talked into reuniting with former comedy partner George Burns for a television special (it's said they were a team for 43 years, which begs the question \"how long did vaudeville last, anyway?\"). Burns, who won a Supporting Oscar, has the misfortune of coming to the film some thirty minutes in, after which time Matthau has already blasted the material to hell and back. The noisier the movie gets, the less tolerable and watchable it is. Director Herbert Ross only did solid work when he wasn't coupled with one of Neil Simon's screenplays; here, Ross sets up gags like a thudding amateur, hammering away at belligerent routines which fail to pay off (such as semi-incoherent Matthau showing up at a mechanic's garage to audition for a TV commercial). At this point, Matthau was still too young for this role, and he over-compensates by slouching and hollering. It was up to Ross and Simon to tone down the character, to nuance his temperament to give \"The Sunshine Boys\" some sunniness, yet Walter continues to project as if we'd all gone deaf. The picture looks terribly drab and crawls along at a spiritless pace; one loses hope for it early on. *1/2 from ****", "LBL": "negative"}
{"TEXT1": "I like Goldie Hawn and wanted another one of her films, so when I saw Protocol for $5.50 at Walmart I purchased it. Although mildly amusing, the film never really hits it a stride. Some scenes such as a party scene in a bar just goes on for too long and really has no purpose.<br /><br />Then, of course, there is the preachy scene at the end of the film which gives the whole film a bad taste as far as I'm concerned. I don't think this scene added to the movie at all. I don't like stupid comedies trying to teach me a lesson, written by some '60's burn out especially!<br /><br />In the end, although I'm glad to possess another Hawn movie, I'm not sure it was really worth the money I paid for it!", "LBL": "negative"}
{"TEXT1": "Protocol is an implausible movie whose only saving grace is that it stars Goldie Hawn along with a good cast of supporting actors. The story revolves around a ditzy cocktail waitress who becomes famous after inadvertently saving the life of an Arab dignitary. The story goes downhill halfway through the movie and Goldie's charm just doesn't save this movie. Unless you are a Goldie Hawn fan don't go out of your way to see this film.", "LBL": "negative"}
{"TEXT1": "When an attempt is made to assassinate the Emir of Ohtar, an Arab potentate visiting Washington, D.C., his life is saved by a cocktail waitress named Sunny Davis. Sunny becomes a national heroine and media celebrity and as a reward is offered a job working for the Protocol Section of the United States Department of State. Unknown to her however, the State Department officials who offer her the job have a hidden agenda.<br /><br />A map we see shows Ohtar lying on the borders of Saudi Arabia and South Yemen, in an area of barren desert known as the Rub al-Khali, or Empty Quarter. In real life a state in this location would have a population of virtually zero, and virtually zero strategic value, but for the purposes of the film we have to accept that Ohtar is of immense strategic importance in the Cold War and that the American government, who are keen to build a military base there, need to do all that they can in order to keep on the good side of its ruler. It transpires that the Emir has taken a fancy to the attractive young woman who saved him and he has reached a deal with the State Department; they can have their base provided that he can have Sunny as the latest addition to his harem. Sunny's new job is just a ruse to ensure that the Emir has further opportunities to meet her.<br /><br />A plot like this could have been the occasion for some hilarious satire, but in fact the film's satirical content is rather toned down. Possibly in 1984 the American public were not in the mood for trenchant satire on their country's foreign policy; this was, after all, the year in which Ronald Reagan carried forty-nine out of fifty states in the Presidential election and his hard line with the Soviet Union was clearly going down well with the voters. (If the film had been made a couple of years later, in the wake of the Iran/Contra affair, its tone might have been different).<br /><br />The film is not so much a satire as a vehicle for Goldie Hawn to show off her brand of cuteness and charm. Sunny is a typical Goldie character- pretty, sweet-natured, naive and not too bright. There is, however, a limit to how far you can go with cuteness and charm alone, and you cannot automatically make a bad film a good one just by making the leading character a dumb blonde. (Actually, that sounds more like a recipe for making a good film a bad one). Goldie tries her best to save this one, but never succeeds. Part of the reason is the inconsistent way in which her character is portrayed. On the one hand Sunny is a sweet, innocent country girl from Oregon. On the other hand she is a 35-year-old woman who works in a sleazy bar and wears a revealing costume. The effect is rather like imagining Rebecca of Sunnybrook Farm grown up and working as a Bunny Girl.<br /><br />The more important reason why Goldie is unable to rescue this film is even the best comedian or comedienne is no better than his/her material, and \"Protocol\" is simply unfunny. Whatever humour exists is tired and strained, relying on offensive stereotypes about Arab men who, apparently, all lust after Western women, particularly if they are blonde and blue-eyed. There was a lot of this sort of thing about in the mid-eighties, as this was the period which also saw the awful Ben Kingsley/ Nastassia Kinski film \"Harem\", about a lascivious Middle Eastern ruler who kidnaps a young American woman, and the mini-series of the same name which told a virtually identical story with a period setting. The film-makers seem to have realised that their film would not work as a pure comedy, because towards the end it turns into a sort of latter-day \"Mr Smith Goes to Washington\". Sunny turns from a blonde bimbo into a fount of political wisdom and starts uttering all sorts of platitudes about Democracy and the Constitution and the Citizen's Duty to Vote and We The People and how the Price of Liberty is Eternal Vigilance blah blah blah\u0085\u0085, but in truth the film is no more successful as a political parable than it is as a comedy.<br /><br />Goldie Hawn has made a number of good comedies, such as \"Cactus Flower\", \"Overboard\" and \"\"Housesitter\", but \"Protocol\" is not one of them. I have not seen all of her films, but of those I have seen this dire comedy is by far the worst. 3/10", "LBL": "negative"}
{"TEXT1": "A wonderful film to watch with astonishing scenes and talented actors, such as Misa Shimizu and Nagiko Tono. After 15 minutes of watching, your eyes get locked on the screen and you do nothing but breathing in the atmosphere of the film waiting what the destiny will bring to the characters. This film makes you leave your position as a standard audience, it takes you in, it makes you a part of the story... Costumes and settings are brilliant; especially the district of the okiyas is skillfully built. It is definitely not very Akira Kurosawa, however it still gets a lot from the master, especially the stylistic story telling tells us we're in a distinguished land of cinema which is quite far from hollywoodish flamboyance.", "LBL": "positive"}
{"TEXT1": "A tragically wonderful movie... brings us to a Japan that does not exist anymore. Despite Hollywood's technical expertise, I have yet to see a (hollywood) movie that can match the authenticity of the atmosphere in this small town by the river near the sea... Tom Cruise's The Last Samurai looked liked the last installment of the Lord of The Rings in trying to capture rural Old Japan.<br /><br />If you like serene but intense story lines, this is a must see film. It will be a respite from hollow flashy films much like the last 1000 blockbusters you saw. I think this is one of Kurosawa's better stories.<br /><br />Even if it's a movie about geishas and brothels and the complicated rules that govern life in such settings, it did not turn into a skin flick. The characters are full of depth and act with much intensity.", "LBL": "positive"}
{"TEXT1": "My boyfriend and I both enjoyed this film very much. The viewer is swept away from modern life into old Japan, while at the same time exposed to very current themes. The characters are realistic and detailed; it has an unpredictable ending and story, which is very refreshing. The story is made up of mini-plots within the life of several geisha living together in a poor city district. I highly recommend this movie to anyone who is interested in a realistic romance or life in old Japan.<br /><br />", "LBL": "positive"}
{"TEXT1": "'Umi wa miteita' ('The Sea is Watching') was Akira Kurasawa's swansong to film: his adaptation of his favored novelist Shugoro Yamamoto's story into a screenplay he intended to film was his final mark he left on a brilliant career. Director Kei Kumai pays homage to both Kurosawa and Yamamoto in presenting this visually stunning transformation of word to image.<br /><br />Set in 19th century Japan, the story explores the lives of the women of a Geisha house whose sole purpose in life is to earn money by pleasuring men. The house is run by an older couple who are genteel and the geishas are an enchanting group of women who know their trade and take pride in their careers. Each has a reason for turning to the life of geisha. Oshin (Nagiko Tono) supports her family who live in a neighboring village, Kikuno (Misa Shimizu) has customers both good and evil whom she manages to sustain with her stories of her higher caste. Oshin befriends an endangered samurai, falls in love with the gentle fellow, only to find that he must not marry out of his caste and leaves his pleasures with Oshin to marry his promised betrothed. Oshin's heart bruises easily but is always supported emotionally and physically/monetarily by Kikuno and the other geishas.<br /><br />A handsome samurai Ryosuke (Masatoshi Nagase) enters Oshin's life and develops the first trusted and devoted relationship with her. Kikuno is beset by problems, deciding whether to accept the humble love of an old man who wishes to marry her, and coping with a rich but abusive customer. All the while the sea is watching and as a typhoon destroys the geisha house and street, Oshin and Kikuno sit atop the roof waiting for the promised rescue by Ryosuke. The manner in which the story ends is one of sacrifice, love, and devotion. The sea is watching and will find protection for true love.<br /><br />The photography by Kazuo Okuhara is breathtakingly beautiful: night scenes with glowing lanterns and colorful geisha interiors are matched with recurring glimpses of the sea both calm and turbulent. The acting is a bit strained for Edo art, but the characters are well created and keep the story credible. The one distraction which is definitely NOT something Kurosawa would have condoned is the tacky Western music score that sounds like cheap soap opera filler except for the isolated moments when real Japanese music on authentic instruments graces the track. But in the end there is enough of Kurosawa's influence to imbue this film with his brand of dreamlike wonder that will always maintain his importance on world cinema. Grady Harp", "LBL": "positive"}
{"TEXT1": "I'm not sure how I missed this one when it first came out, but I am glad to have finally seen it.<br /><br />This movie takes place in and around the 19th century red light district of Okabasho, Japan. It tells the tale of prostitution, caste systems and women who are strong in a society based upon the strength of the samurai code of Japan.<br /><br />It is uniquely Akira Kurosawa! Even though he died before he could direct this movie, his adaptation of the screenplay shows. His view of the Japanese world and caste system is renowned and sheds light upon how these systems interact with each other. The characters may revolve around each other, but the caste system stays intact when each character goes back to the world they belong in. The samurai warrior who drifts into the good hearted and loving prostitute's world goes back to his life, while she embarks on a another road with a man who is part of her caste system..lowest of the low. Many prize the world of the samurai above all others, but yet, it is the lower caste inhabitants who can support each other and who can love without restraint. The samurai in this movie turns out to be the weak one, while the classless lovers prove to be the honorable ones. <br /><br />The movie deserves a higher rating. It is a tale of survival of women in feudal Japan. During this time frame, men were thought to be the survivors..the strong ones while women were thought to be just mindless and weak property. This movie highlights the strength of Japanese women and how they did what they had to for survival, and how their strength enabled the Japanese culture to continue on as it has.<br /><br />I recommend \"The Sea is Watching\" to anyone who is a fan of Akira Kurosawa and even if they're not a fan. It is a lovely, quiet and soul sustaining movie, and one to be treasured for any movie collection.", "LBL": "positive"}
{"TEXT1": "this movie just goes to show that you dont need big explosions,muti-billion dollar computer graphics,or highly over paid actors and actresses to make a good movie, All you need is a excellent story line and plot. which the master of all japanese films,Akira Kurosawa pulls off brilliantly. I recommend this film to all that love a epic period piece. and for those that enjoy Kurosawas earlier works. 10/10", "LBL": "positive"}
{"TEXT1": "It helps immensely if one is familiar with the culture and time period in which this film takes place. First of all, these ladies are NOT geisha, they are oiran (prostitutes)in the Yoshiwara-type \"green houses\", circa 1860, give or take.. This should help clear up some details which may be confusing to the unaware. The film deals with issues of loyalty, love and, perhaps most importantly, how people deal with adversity, both their own and that of others in their immediate environment. That plus the outrageous photography together with the hauntingly beautiful music, make for a lovely ride. Just plug it in, suspend your disbelief and enter their world. You won't be disappointed.", "LBL": "positive"}
{"TEXT1": "This is a wonderful movie about a brothel in a fishing village, that could be best described with scene constellations and direction of old Kurosawa's works, combined with Dostoyevski's topics of human psychology (O-shin - Sonia Marmeladova ), Shakespeare's drama and Hans Christian Andersen's tragic and cheerfulness. The screenplay is wondrous, the scenes are colour- and beautiful some scenes stay really imprinted in my mind. The plot is interesting and unpredictable - each of the characters is very well developed and interesting - there is also a little action, so if you don't like all the sentiments you'd also come to your costs - . It is not about mysterious Geishas and proud Samurai with their Bushido pouring all out of them, but about life, work and kinds of people found everywhere at any time. A lovely and fascinating tribute to Kurosawa, certainly worth seeing.", "LBL": "positive"}
{"TEXT1": "This is a very fine and poetic story. Beautiful scenery. Magnificent music score. I've been twice in Japan last year and the movie gave me this typical Japanese feeling. The movement of the camera is superb, as well as the actors. It goes deep into your feelings without becoming melodramatic. Japanese people are very sensitive and kind and it's all very well brought onto the screen here. The director is playing superb with light an colors and shows the audience that it is also possible to let them enjoy a movie with subtle and fine details. Once you've seen this movie you will want to see more from the same director. It's a real feel good movie and I can only recommend it to everybody.", "LBL": "positive"}
{"TEXT1": "Kurosawa weaves a tale that has a cast of characters as diverse as any Shakespearean drama, and the acting is true to the story, with each star playing their role as a part of the larger tale. It is touching, funny and intriguing in all parts. The character development is near perfect, the cinematography is vivid and engaging, and the story draws you in.<br /><br />I would like to say that the \"Samurai freaks\" and those obsessed with late 18th and 19th century dynastic tales of Japan may snub this film as not Kurosawa's best work. Perhaps not his best, but even at his worst, Kurosawa is better than many of the best. This story is so based in elevating the mundane lives of ordinary people in a time of great change, that it is timeless, despite being set in the not-so-distant past.<br /><br />I would heartily recommend this to any movie buff, and especially to those who are likely to continue on to read the novel on which the film is based.", "LBL": "positive"}
{"TEXT1": "The Sea Is Watching has been made from an original Akira Kurosawa script, and it is indeed a lush and warm film. Watching it will be a pleasure !<br /><br />Kei Kumai as director is certainly no equal to the old but everlasting master (particularly the mass scenes in the beginning of the film has some terrible acting), but the overall mood and scenery is very enjoyable. Another thing that is missed here: Kurosawa always managed to let the characters be so much more then what they are actually showing and doing.<br /><br />Probably that was his magic on set while shooting; and just maybe this script was not fully up to par yet.<br /><br />Maybe we just miss the eye of the master.<br /><br />This is one lovely and sweet film, but it is no Kurosawa. To expect that might well be very silly...", "LBL": "positive"}
{"TEXT1": "Artistically speaking, this is a beautiful movie--the cinematography, music and costumes are gorgeous. In fact, this movie is prettier than those directed by Akira Kurasawa himself. In this case, he only wrote the movie as it was made several years after his death.<br /><br />So, as far as the writing goes, the dialog was well-written and the story, at times, was interesting. However, the story was also rather depressing yet uninvolving in some ways--after all, it's the story of a group of women who work in a brothel. It's interesting that although prostitution has been seen as a much more acceptable business in Japan, the women STILL long for a better life. This reminds me a lot of the movie Streets Of Shame, though Streets Of Shame's characters are a lot less likable and more one-dimensional.<br /><br />So, overall it gets a 7--mostly due to everything BUT the writing. It's too bad that the weakest link in this movie is the story by the great Kurasawa.", "LBL": "positive"}
{"TEXT1": "The Sea is Watching was an interesting film experience. First of all, the overall feel was intense, internalized, claustrophobic, and small. Each frame seemed to be a photograph of something inside, something very focused and not part of a bigger picture. It was obvious what we were to look at in each frame. The physicality of the set itself contributed to that feeling of smallness and intensity. The lights along the middle of the road cut the road in half, and the tiny gate to the tiny settlement followed by the tiny and few cubbyholes that served as the establishments that made up what seemed to be the entire town. Even the view of the ocean was framed by a tiny landing on which one can count the number of longer grass swaying in the wind. No panoramic views. In fact, it reminded me of the Montmarte sequence of Moulin Rouge where the camera sweepingly focuses in to the windmill creating again a feeling of a small area where everything is happening.<br /><br />While the acting was passable considering I really could not discern how the lines were truly delivered, I felt that the actions were overly melodramatic and nonsensical. Why Kikuno would continue carrying on the way she did when Fusanosuke announced his impending marriage really didn't seem true \u0096 people hadn't really changed that much, and the character Kikuno was so strong and resilient that even if they were busy taking on O-shin's business for naught, the reaction seemed out of character and unnecessary and distracting. Another example of odd acting was when the drunk boyfriend of Kikuno showed up and Ryosuke decided to intervene and was pushed down the stairs, the way in which he got up and menacingly came up the stairs and the ensuing fight outside among the reeds was simply unsatisfying. It wasn't that I like fight scenes \u0096 au contraire \u0096 but it seemed a little stilted and again, overly dramatic.<br /><br />Otherwise, while not a beautiful movie to watch, it provided an interesting glimpse into the darker side of prostitution (as opposed to the geisha). Unfortunately, perhaps it fed into our expectations of wanton women (the \"honey \u0096 I'll give you a deal\" comments supported by the over-stretched actions) and seriously caused me to doubt whether indeed 19th century prostitutes really acted in that way. But once inside the house, the inner workings became most interesting, vivid and real and provided a scenario I never anticipated or imagined in my romantic view of Japan in the 19th century.", "LBL": "positive"}
{"TEXT1": "Although Lang's version is more famous,Borzage's work is not devoid of interest ,far from it:its \"celestial\" sequences are even better.The metaphor of the train (perhaps borrowed from the ending of Abel Gance's \"la roue\" ) is eventually more convincing than the \"up above\" heavenly world.<br /><br />Borzage's tenderness for his characters shows in Marie's character and love beyond the grave is one of his favorite subjects (the ending of \"three comrades\" ).The amusement park seems to be everywhere: we see it even when we are in Marie's poor house.I do not think that the sets are that much cheesy,they are stylized to a fault.The fair from a distance almost gives a sci-fi feel to the movie.<br /><br />Borzage never forgets his social concerns: in the heavenly train going up,the Rich cannot stand to be mixed up with the riffraff but as \"chief magistrate\" tells :\"here there's no more difference\" .<br /><br />Not a major work for Borzage (neither is Lang's version),but to seek out if you are interested in the great director's career.", "LBL": "positive"}
{"TEXT1": "There is indeed much to complain about this movie version of Molnar's mystical play --Farrell looks good in his title role, but his line readings, frankly, stink. This also suffers, in large part, from this being credited as the first movie that makes use of rear projection. The sets look phony.<br /><br />There are two great strengths in this show, however: although the dialogue readings limp, the visual performances are perfect. Rose Hobart, as Julie, is little remembered today: mostly for ROSE HOBART, in which Joseph Cornell cut down the programmer EAST OF BORNEO to simply shots of her: credit Melford's stylish visual direction of the original. Her great beauty and simple (although stagy) performance help repair some of the damage to the earth-bound sections of this movie.<br /><br />However, one of Borzage's themes is the mystical power of love, and it is the handling of the celestial sections that make this great, from the arrival of the celestial train to the journey to 'the Hot Place'. H.B. Warner's performance here is, as always, perfect.<br /><br />So we have here a flawed but very interesting version. I think that Lang's 1934 version is better, as well as the celestial scenes in the Henry King version of CAROUSEL, the watered-down musical remake. But I still greatly enjoyed this version and think you should give it a chance.", "LBL": "positive"}
{"TEXT1": "Loved Joan. Great performance. What isn't she good in. I watched this film and then Jane Eyre right after... she just keeps getting better. My heart was racing. Great old movie drama. Just what i want from a classic movie. Facial expressions are worth the whole film. I'm glad i have it on video. Don't know what more you need in a film. Beautiful woman....wealth..... greed.....murder....detectives......a trial.....<br /><br />The costumes are very nice. Makes me wonder what the budget was for this movie? Wish they still made films like this. Whenever they try they just seem to make a cheesy movie. Films in black and white still hold a certain mystery.", "LBL": "positive"}
{"TEXT1": "Joan Fontaine stars as the villain in this Victorian era film. She convincingly plays the married woman who has a lover on the side and also sets her sights on a wealthy man, Miles Rushworth who is played by Herbert Marshall. Mr. Marshall is quite good as Miles. Miss Fontaine acted her part to perfection--she was at the same time cunning, calculating, innocent looking, frightened and charming. It takes an actress with extraordinary talent to pull that off. Joan Fontaine looked absolutely gorgeous in the elegant costumes by Travis Banton. Also in the film is Joan's mother, Lillian Fontaine as Lady Flora. I highly recommend this film.", "LBL": "positive"}
{"TEXT1": "Poor Ivy: Though to the manner born, she had the bad luck to marry a charming wastrel (Richard Ney). As the movie is set in the 20s or 30s, when rigid Victorian ideas of class were starting to fray at the edges, this uncertain status vexes her unduly. The Gretorexes (for so they are called) don't know where their next shilling is coming from but there are yachting parties and fancy-dress balls in posh pleasaunces aplenty to tempt her. When Ivy (Joan Fontaine) makes the acquaintance of a wealthy older gent (Herbert Marshall, who must have been born middle-aged), she sets one of her extravant chapeaux for him. Luckily, one of the beaux she still strings along (Patric Knowles) is a physician whose consulting rooms provide a cache of poison, with which she bids her hubby farewell. The fact that it implicates Knowles doesn't phase her a bit, even as the hours trickle by until he should be hanged by the neck until dead. The turning of the plot depends on police inspector Sir Cedric Hardwicke; Knowles' mother (the redoubtable Lucile Watson); and Knowles' loyal housekeeper (Una O'Connor). Sam Wood adds some subtle touches to this well above average melodrama; Fontaine's luminous face supplies the rest.", "LBL": "positive"}
{"TEXT1": "An excellent period murder melodrama, with Fontaine effectively playing against her earlier naive wallflower type, in a role that reportedly Olivia DeHavilland turned down. That's fine, because Fontaine is wonderful. Scripted by Charles Bennett, who had written for Hitchcock in the thirties and also later penned the excellent script for the classic British horror film Night of the Demon. The opening scene, where Ivy visits a sinister fortune teller played by the wonderful Una O'Connor (the screecher of James Whale fame), is a tour de force, and the film maintains interest throughout the numerous sinister machinations. I hope to see this film on DVD someday, but despair of that ever happening, because it seems to be an undeservedly obscure film. Fortunately I got to see it on AMC some seven or eight years ago, but have not seen since. Catch it if you can!", "LBL": "positive"}
{"TEXT1": "Warning: contains a spoiler. Corny plot and in many cases terrible acting. Fontaine is great, but some others, particularly Richard Ney, Ivy's husband, are exceedingly wooden. Ney lies in bed, dying of arsenical poisoning, with every hair in place. Yet the movie is so juicy and so suspenseful. More faithful to the book than most movies of its era. Casting Joan Fontaine as a poisoner (and an adulteress, which was just as shocking then - I'm not kidding, kids) was a masterful stroke. She's just her usual Joan Fontainey self. As murderers were supposed to, she dies by falling \"feet foremost through the floor into an empty space.\"", "LBL": "positive"}
{"TEXT1": "Does anyone happen to know where this film was shot? The aviation scene on the cliff is beautiful. It appears to be England. However, Ivy's apartment building certainly looks like the Brill Building, with its fascinating elevators.<br /><br />Charles Mendl is listed as playing \"Sir Charles Gage\". Maybe I blinked, but I never saw him. Perhaps he was the husband's lawyer, but, again, I don't recall that character being in the film, other than being mentioned as having made a phone call. Perhaps he was in the aviation scene? Or the ballroom scene? Did anyone spot him?<br /><br />Herbert Marshall was 57 years old when he shot this film.", "LBL": "positive"}
{"TEXT1": "Joan Fontaine here is entirely convincing as an amoral beauty who is entirely incapable of feeling love for anyone but herself. Her husband (Richard Ney) has lost all his money through a combination of his foolhardiness and her extravagance, and they are reduced to living in a tiny room, with little or no prospects. They continue to put on the most amazing clothes and go out and socialize as if nothing were wrong. He is a charming, feckless, but wholly amiable fellow. However, Fontaine decides he has to go, as he has outlived his usefulness. So she resolves to poison him when she realizes he does not want to divorce her, so that she can move on. She has meanwhile had a lover (Patric Knowles) whom she decides to drop because he is not rich either. She meets the aging Herbert Marshall, who has a yacht with all the trimmings and more money than even Fontaine could figure out how to spend. She targets him and decides he will do nicely. He is all too eager to be eaten up by the young beauty. He certainly isn't very exciting, and has about as much sex appeal as yesterday's omelette. But Fontaine is one of those gals who has eyes only for money, and the man standing between her and it is transparent, so that she doesn't even notice or care what he looks like, she looks through him and sees what she really wants and goes for it. She proceeds to poison her husband, and dispatches him very neatly and satisfactorily, so that everything is going well. But as always happens in the movies, and sometimes even in life, some unexpected things begin to go wrong, and the tension rises appreciably, so that Fontaine begins to sweat. Fontaine is particularly good at looking wicked and terrified, and as the net begins to close in on her, her rising sense of desperation is palpable and has us on the edges of our seats. Hysteria and fear take over from cool calculation and cunning. But she finds a fall guy for her crime in the person of her cast off lover, who is an innocent victim of her scheme to set him up. He is condemned to death for murder, because the husband's death by poison came to light unexpectedly. But Sir Cedric Hardwicke, playing a grimly determined Scotland yard inspector, thinks there may be something amiss, and begins to doubt the story and suspect Fontaine. He closes in on her, and some of the scenes as this happens are inspired portrayals of the wildest panic. But will the innocent man's life be saved before he is executed? Will Fontaine worm her way out of this one? Will Herbert Marshall protect her to safeguard his infatuation? This film is expertly directed by Sam Wood, and the film is a really superb suspense thriller which I suppose qualifies very well for the description of a superior film noir.", "LBL": "positive"}
{"TEXT1": "Having seen the short a number of times at horror movie marathons, I believe it to be a humorous parody that slices to the main point of its reference.<br /><br />Though the themes are crusty and stale to today's viewers, it is by no means a crumby waste of time.<br /><br />Though being a student film gives little rise to an excuse, the proof is that it appears crafted with care on a budget of little to no dough.<br /><br />As noted by another reviewer, it is less than ten minutes which is plenty of time to cleanse the viewing palate with a toast of joy, sit back and loaf idly through the film.<br /><br />I think this short-bread of a film should be enjoyed as an appetizer for the title reference and the viewer should relax and roll with it.", "LBL": "positive"}
{"TEXT1": "Being someone who lists Night of the Living Dead at number three in her top five favorite movies of all time, and at the same time loving this student film parody, I feel I must defend this movie against the previously posted scathing reviews. This short but sweet opus has always been a crowd-pleaser at horror and science fiction movie marathons where those who attend have a love of the genre yet know not to take zombie movies too seriously. This film is a tribute to the original, not an insult. It is intended to be funny, and many others who I have heard chant for and applaud it agree with me that it succeeds. Especially for those of us who have seen NOTLD 50+ times. Watch for the director cameo as news reporter Jeff Drexel, and also if you have the opportunity catch his Alien parody, Loaf.", "LBL": "positive"}
{"TEXT1": "I just viewed this great good-natured parody of Night of the Living Dead, and I have to say it was so awful and so corny it was excellent. This movie incorporated all the antics and scenery shots that the original had including the cemetery, the supposable abandoned house, the basement and the front lawn. What I especially love about this movie is the comical use of bread and all the common household enemies bread has a grudge against. C'mon, we know that toasters, toaster ovens and zip-locks have done bread in a dozen times and now we must call for their help in order to defeat the reanimated bread. Aside from the cheap acting and voice-overs, this short horror film is my personal favorite parody of Night of the Living Dead, even better than Night of the Living Dead of 1990.<br /><br />I think what makes this movie worth watching is how the writers and directors utilized all the dialogue from the original movie and revolved it around bread, including how the bread became reanimated and to avoid leftovers because they are especially dangerous. Another great reason why I love this movie is that, there is no exception as to what bread is evil, bagels are evil and even communions are evil, which is demonstrated by a hilarious scene involving a newscaster and a rather monotone priest. I think that the actors are especially humorous performing the deed of being viscously attacked by slices of bread (i.e. the car scene). I think the end is very worth sticking around.<br /><br />Even though this is a short and that \"Night of the Day of the Dawn of the Son of the Bride of the Return of the Revenge of the Terror of the Attack of the Evil, Mutant, Alien, Flesh Eating, Hellbound, Zombified Living Dead Part 2: In Shocking 2-D\" is debatably another great parody, it's still recommend as a great horror parody done by, what seems to be college filmmakers. I highly recommend this movie to anybody who is able to make fun of Night of the Living Dead and still have respect for the filmmakers. I would also like to recommend this movie to anybody who loves D-movies and horror parody's, it's just a wonderful little short horror film that's fun to watch and learn.", "LBL": "positive"}
{"TEXT1": "Before viewing, please make sure you have seen Night of the Living Dead... This might well be THE best 7 minute parody I have ever seen! Absurd, crappy 'special effects' (the rope, the rope!!!), and maneating slices of bread... what more do you need???<br /><br />(Do not watch this movie while eating bread... you might get scared!)", "LBL": "positive"}
{"TEXT1": "\"Bread\" very sharply skewers the conventions of horror movies in general and \"Night of the Living Dead\" in specific and is constantly inventive. The production values are a little rough at times (it's a student film, after all), but it never loses sight of its goal to entertain. Hey -- George Romero liked it enough to include it on the remastered \"Dead\" video tape, laserdisc and DVD... that should tell you something.", "LBL": "positive"}
{"TEXT1": "By 1987 Hong Kong had given the world such films as Sammo Hung's `Encounters of the Spooky Kind' Chow Yun Fat in John Woo's iconic `A Better Tomorrow', `Zu Warriors' and the classic `Mr Vampire'. Jackie Chan was having international success on video, but it was with `A Chinese Ghost Story' that HK cinema had its first real crossover theatrical hit in the West for many years.<br /><br />Western filmgoers had never seen anything like it. It was a film that took various ingredients that HK cinema had used for years (flying swordsman, wildly choreographed martial arts and the supernatural) and blended them to create a film that was unique in its look, feel and execution. Forget the poor and unnecessary sequels it spawned, this is the original and best.<br /><br />Director Siu-Tung Ching (still best known as an Action Choreographer on such films as Woo's `A Better Tomorrow 2'/'The Killer') has, under the watchful eye of legendary Producer Tsui Hark, created a masterpiece of Fantasy/Horror cinema. And with such an expert crew at his disposal (no less than 6 Martial Arts Coordinators) the chances of the film being anything but wonderful would be unthinkable.<br /><br />The editing by the amazingly prolific David Wu (who wrote/directed `The Bride With White Hair 2' and edited such classic titles as `A Better Tomorrow 1/2/3', `Hardboiled' and the cult hit `The Club') is quite simply a work of genius. His crafting of the perfectly choreographed high flying, tree climbing sword fights makes them some of the best HK cinema has ever created. Fast moving, outlandish but never confusing they are, even today, the pinnacle of their art.<br /><br />The crew of cinematographers have also done miracles. This is a film where every shot is an expertly crafted painting. Where wonderful blue tinged night sequences, shrouded in an ever-present ghostly fog, are the breathtaking platform for our story to unfold. It's a film where everything is used to weave a dreamlike beauty. Even the silken robes and dresses worn by Hsiao Tsing become living parts of the movie, whether in romantic sequences or battle scenes the ever present silk flows across the screen. Even a simple scene where Hsiao Tsing changes robes is turned into a thing of fluttering beauty as every skill on the set combines to create a most memorable scene from such a simple act. The sets are also amazing, giving an other worldly sense to the forests, and the temple and harshness to the scorched, flag filled wasteland of hell for the amazing finale. The production design by Zhongwen Xi deserves the highest praise.<br /><br />Another major factor to the films success is the music by Romeo Diaz and James Wong. Hong Kong films have given us some fantastic music and songs that have added so much to the success of a sequence, but on `A Chinese Ghost Story' the music is, quite simply, vital. From the opening song onwards the music becomes as important as the characters.<br /><br />The score is a perfect mixture of modern and traditional instruments. Drums, bells and guitars pound away over the action sequences to great effect, but it's in the slower, achingly romantic pieces that it comes into it's own. Here; flutes, strings and female choral effects create what are possibly the finest pieces of music heard in an HK film. Add to this the female vocal, stunningly beautiful song that plays over Tsau-shen's and Hsiao Tsing's love making, (nothing is ever seen, but the effect is wonderful. This is lovingly innocent movie romance) and you have a shining example of the power a film's music can have.<br /><br />And we of course have the acting talent. Leslie Cheung (`A Better Tomorrow 1 & 2' and a very popular singer) is outstanding as the innocent tax collector. His work in the (thankfully mild) comic sequences is never over the top and his scenes with Joey Wang are played with just the right amount of passion and innocence.<br /><br />Joey Wang (who would later be mostly relegated to support roles in films like the Chow Yun Fat/Andy Lau classic \"God of Gamblers\") has never looked more radiant than how she does here. She is the epitome of ethereal beauty. Her portrayal of the tragic Hsiao Tsing is stunning. She shows her characters sadness at what she has become and what she is made to do, but also gives off a subtle eroticism in the scenes where she is luring the men to their gruesome deaths. Veteran actor Wu Ma (`Mr. Vampire', `Swordsman') is great fun as the wise, brave, but ever so grumpy, Yen. He treads a fine line between the eccentric and the annoying with practised ease. And what so easily could have been a character that could have harmed the film is actually wonderfully entertaining and memorable.<br /><br />But what about the monsters and beasties?, I hear you cry. Well they range from the rather crude but fun stop motion/animatronic zombies that inhabit the temple (resulting in a great running gag with constantly thwarted attempts to munch on the amusingly unsuspecting Tsau-shen), to the rather cheesy but surprisingly effective Lord Black. Complete with an arsenal of vicious flying heads, and quite outstanding wire work. Most of which has, to this day, never been topped.<br /><br />But the most outstanding effect and creation is the tree spirit's killer tongue. We first encounter this thing with an `Evil Dead' style rushing camera effect as it powers down its victims throats to deliver a lethal French kiss that turns the victims into zombiefied husks. But later it's shown in all its crazy glory. It can grow so big and long that it shoots through the forest after prey, rips apart trees, wraps itself around buildings and coils it's slimy length around people before picking them up and throwing them against tree trunks!! It can even split open to reveal a fang filled mouth! It's an outrageous idea that given the deeply romantic main plot shouldn't work. But it does, to fantastic and unforgettable effect.<br /><br />So what all this adds up to is a classic example of Hong Kong movie making. A true team effort that has given us a truly ground breaking movie. It's a film packed with wit, invention, action, monsters, martial arts, ghosts, fantastic ideas, lush visuals, beautiful music, and most important to it's enduring charm, one of cinemas most moving romances.", "LBL": "positive"}
{"TEXT1": "I saw this movie first on the Berlin Film Festival, and I had never seen Hong Kong cinema before. I felt like sitting in a roller coaster: the action was so quick, and there wasn't one boring moment throughout the film. It has martial arts, love, special effects and a fantastic plot. My favorite scene is when the Taoist drinks, sings and fights for himself - one of the many scenes which stress the extraordinary musical component of the movie. This film is a definite must!!", "LBL": "positive"}
{"TEXT1": "I first saw this film when it was transmitted around 1988 by the BBC when I was working on UK's 2000AD. My pal Steve Parkhouse recorded it on VHS and sent it to me. Up till this point, I'd really only seen the Shaw Bros kung fu movies, with their harsh lighting (so audience could see the moves clearly), so it was a revelation to me to see something that looked like it had been lit by Ridley Scott coming out of Hong Kong. This was also my first exposure to the movies of Tsui Hark (pronounced, apparently, \"Choy Huk\").<br /><br />Yet for all the smoky, back-lit exteriors and ambitious special effects (Stop-motion? In a Hong Kong Movie?) at the heart of Chinese GHOST STORY lies a simple and moving love story, made all the more real by the outstanding acting talent of Leslie Cheung (what a tragic, tragic waste of a life!) and the beauty and elegance of Joey Wong. Granted Joey is gorgeous, but it's her balletic hand gestures that give her character an unattainable eroticism that's hard to analyse. And though Joey is now almost 20 years older (gawd, which of us isn't?) this will always be the enduring image of that actress.<br /><br />Some reviewers here have said that the film is simplistic and lacks any surprises, but they're missing the fact that this movie was based on a famous Chinese story written by Pu Songling around 1700! That's a bit like complaining that Romeo and Juliet has a predictable ending and just copies WEST SIDE STORY. (Just wanted to get that off my chest!)<br /><br />For me, Chinese GHOST STORY is the quintessential romantic tale. It has high tragedy, because we know that Chio Sin and Sin Seen can never be together. It's about becoming mature, for none of us can mature until we've experienced great loss. It's about sacrifice, for sacrifice is an essential component of True Love. And the comedy stylings of Wu Ma don't hurt a bit, either.<br /><br />Enjoy Chinese GHOST STORY by trying not to view it through a filter of Western culture and you'll get on with it just fine.", "LBL": "positive"}
{"TEXT1": "This movie is incredible.With great characters,specially the old swordsman that can fly in the shape of fireball and jump across the trees,this film tells a classic story of battle between good and forces of evil.The final showdown is specially breathtaking and the music score is kinda cool.<br /><br />Very,very recommendable.Not for the smallest children though.This one deserves a 10.", "LBL": "positive"}
{"TEXT1": "This is the best Chinese movie I have ever seen, and, in my opinion, a lot better than Hero or Chrouching Tiger, Hidden Dragon. The movie is a unique combination of several genres: It's a beautiful love story, action movie, comedy and horror at the same time. And the most amazing thing is that it really succeeds in all of this!<br /><br />This movie definitely makes it to my top 5, and should be enjoyable to every movie lover. The action sequences do have the traditional unrealistic jumping and even flying, but the way it's shot differs from the style of Hero a lot and the flying always looks great and usually even makes sense (ghosts can fly)<br /><br />See this movie, you won't regret it. 10/10", "LBL": "positive"}
{"TEXT1": "This movie is one of my favourites. It is a genre-mixture with ingredients of the Action-/Horror-/Romantic-/Comedygenre. Some of the special effects may seem outdated compared to modern standards. This minor flaw is easily ignored. There is so much to discover in this story. The romantic relation between the two main characters is so beautiful that it hurts. The visuals are beautiful too. The action is great which is no surprise, it is originating from Honkong, birthplace of the world's best action movies. The humour sometimes seems a little bit silly but in a good way. Somehow this movie is being able to balance the different moods and keeps being good. Absolutely recommended.", "LBL": "positive"}
{"TEXT1": "I saw this movie in my childhood. And after 10 years I did not remember anything about this movie but I found out it I also don't know how I was able to find out this movie. Its my life. My all times favorite movie. My words will fall short of true meaning what I have inside for this movie. I follow this movie. It's a brilliant mix of fantasy, comedy, romance, horror, erotic, scary and martial arts. The story about the power of love is pretty touching and warm. It's a masterpiece of Hong Kong Cinema.<br /><br />Sinnui Yauman, is without a doubt one of the best ghost stories ever made into film. Written by Songling Pu and directed by Siu-Tung Ching, A Chinese Ghost Story has it all. Ling Choi Sin played by Leslie Cheung is a young man down on his luck who goes in search of a monastery for lodging, deep in the woods, a place the villagers seem very afraid to go near. The trek alone is perilous with wolves, and a crazy taoist monk lives at the temple.<br /><br />Ling Choi Sin meets Tsing, a beautiful and mysterious young girl who also lives nearby in a deserted temple. She is forced to seduce men for her evil mistress, but when she meets innocent Ling Choi Sin they fall in love.<br /><br />Ling Choi Sin is sort of a bumbling fool but his heart is in the right place, while Tsing tries to protect him from the other spirits in the woods, he tries to protect her from the monk who is trying to kill the spirits in the woods. There's great martial arts, even a monk that breaks out into drunken song as he performs ritual taoist sword forms. The movie does a lot of traditional old martial art films acrobatics, with magic and flying through the air, leaping from tree to tree, with elegant long gowns and scarves, but the movie genuinely flows, and everything is effective.<br /><br />Tsing is to be married to a evil tree monster, which cant be good, and we feel her plight in her home where we meet her sisters and stepmother who is truly not nice.<br /><br />In the end they must fight a tree witch with a deadly tongue, and go with Yin deep into the heart of hell to fight a thousand year old evil to save their souls, and bring Ling's ashes back to her home for a proper burial so she may have a chance at reincarnation.<br /><br />A beautiful story that truly pays attention to details. One is touched in many ways by this movie, you'll laugh, cry, and just have fun with the great martial arts and cinematography. And though at the end, Yin and Ling Choi Sin ride off into the morning sun under a enchanting rainbow, we never know if Tsing was afforded a reincarnation, but we do know her.", "LBL": "positive"}
{"TEXT1": "Sinnui yauman, is without a doubt one of the best ghost stories ever made into film. Written by Songling Pu and directed by Siu-Tung Ching, A Chinese Ghost Story has it all. Ling Choi Sin played by Leslie Cheung is a young man down on his luck who goes in search of a monastery for lodging, deep in the woods, a place the villagers seem very afraid to go near. The trek alone is perilous with wolves, and a crazy taoist monk lives at the temple.<br /><br />Ling Choi Sin meets Tsing, a beautiful and mysterious young girl who also lives nearby in a deserted temple. She is forced to seduce men for her evil mistress, but when she meets innocent Ling Choi Sin they fall in love.<br /><br />Ling Choi Sin is sort of a bumbling fool but his heart is in the right place, while Tsing tries to protect him from the other spirits in the woods, he tries to protect her from the monk who is trying to kill the spirits in the woods. There's great martial arts, even a monk that breaks out into drunken song as he performs ritual taoist sword forms. The movie does a lot of traditional old martial art films acrobatics, with magic and flying through the air, leaping from tree to tree, with elegant long gowns and scarves, but the movie genuinely flows, and everything is effective.<br /><br />Tsing is to be married to a evil tree monster, which cant be good, and we feel her plight in her home where we meet her sisters and stepmother who is truly not nice.<br /><br />In the end they must fight a tree witch with a deadly tongue, and go with Yin deep into the heart of hell to fight a thousand year old evil to save their souls, and bring Ling's ashes back to her home for a proper burial so she may have a chance at reincarnation.<br /><br />A beautiful story that truly pays attention to details. One is touched in many ways by this movie, you'll laugh, cry, and just have fun with the great martial arts and cinematography. And though at the end, Yin and Ling Choi Sin ride off into the morning sun under a enchanting rainbow, we never know if Tsing was afforded a reincarnation, but we do know her", "LBL": "positive"}
{"TEXT1": "First things first, the female lead is too gorgeous to be missed. Now actress Wang Zu Xian, the one who played Xiao Qian in the movie, is 42 years old and well aged. It's always good to review these glorious times when seeing old-school HongKong productions like this.<br /><br />The movie is one of the most influential titles made in 1980s. The art set decoration and other aesthetic facets are all mesmerizing. More fantastically the movie had a total black humorous undertone in it. It feels like a horror movie but ultimately it's not scaring, but only fun.<br /><br />I had the experience of translating the second script of \"A Chinese Ghotst Story\", and I thought that script was a decent write. However when I saw the movie, I firstly was disappointed in seeing the movie different from the script, like in a smaller scale and involving more comic roles. However, it turned out to be better executed in terms of being entertaining.<br /><br />If you have seen the Lord of the Rings, you will notice the similarities in this movie to LOTR. The climax is like a mirror of Miranda Otto fighting with the Ring Witch. It's definitely a laugh-out-loud. Bravo!", "LBL": "positive"}
{"TEXT1": "Though I'm not the biggest fan of wirework based martial arts films, when a film goes straight for fantasy rather than fighting I get a lot more fun out of it and this film is one of the best in terms of fantastical plotting and crazy flying shenanigans. Ching Siu Tung has crafted here an enchanting treat with fine performance and much ethereal beauty. The great, tragic Leslie Cheung plays a tax collector hero who stays the night in a haunted temple and gets involved with a stunning fox spirit and a wacky Taoist. Cheungs performance is filled with naive but dignified charm and Wu Ma is pleasingly off the wall as the Taoist monk, who shows off some swordplay and even gets a musical number. Perhaps best off all is Joey Wang as the fox spirit, truly a delight to behold with every movement and gesture entrancingly seductive. The film takes in elements of fantasy, horror, comedy and romance, all stirred together into a constantly entertaining package. Ching Siu Tung, directing and handling the choreography gives some neat wirework thrills, and fills the film with mists, shadows and eerily enthralling benighted forest colours, giving every forest scene a wonderfully bewitching atmosphere. Also notable are the elaborate hair stylings and gorgeous flowing garments of the female characters, with, if I'm not mistaken, Joey Wang sporting hair done up like fox ears at times, a marvellous touch. Though the film features relatively little action and some perhaps ill advised cheesy pop songs at times, this is a beautiful piece of entertainment, with swell characters and plotting, even the odd neat character arc, a near constant supply of visual treats and copious dreamy atmosphere. An ethereal treasure, highly recommended.", "LBL": "positive"}
{"TEXT1": "Ching Siu Tung's and Tsui Hark's A Chinese Ghost Story, aside from being one of the greatest wuxia pian films ever made, is a beautiful and romantic love story as well as an impressively choreographed martial arts film that should belong in every film lover's collection. The sorely missed Hong Kong superstar Leslie Cheung plays a traveling tax collector who spends the night at a haunted temple. While staying at the temple, he meets a colorful cast of characters that include the swordsmen Yin (Wu Ma) and Hsiao Hou, the Tree Devil, and the beautiful ghost Lit Sin Seen, played by the lovely Joey Wong.<br /><br />To free her from the clutches of the evil Tree Devil, he must reincarnate her body and travel to the underworld to defeat an even more powerful demon.<br /><br />Enough good things can't be said about this film. The pacing is perfect, with a great combination of romance, action, fantasy and humor, and the feverishly paced finale should leave you with little chance to breathe. The chemistry between the wonderfully tragic Joey Wong and Leslie Cheung (whose legendary career ended much too soon) really allows the viewer to feel for both of them. Indeed the acting on the whole is so vivacious and full of life, I would say this is one of the most fun viewing experiences I've ever had. Much of the credit goes to Wu Ma in his portrayal of the mysterious Swordsman Yin. His over-the-top persona of a disillusioned swordsman hell bent on vanquishing evil leads to some great moments of humor and traditional HK drama. A wonderful score, lush cinematography with eye popping colors, and frenetic action pieces courtesy of Ching Siu Tung round out this wonderful film. Find a copy anywhere you can. 10/10", "LBL": "positive"}
{"TEXT1": "There are 21 comments as I add mine to this list and there is barely a criticism. This is because this film is terrific entertainment and has a bit of everything in it.<br /><br />It is perhaps a little frightening for younger children but my 15-year old son thought it was fantastic in every way from the action, to the humour and even to the beautiful music score.<br /><br />I buy DVDs only when I know that they are going to be regularly watched and now that this is finally available in the UK, I will certainly be adding it to my collection.", "LBL": "positive"}
{"TEXT1": "Once in a while, a film comes along that raises the bar for every other film in its genre. A film of this caliber will influence many films following its release for years to come. `A Chinese Ghost Story' falls in this category. It is arguably one of the best horror films made during the 1980's; possibly one of the best ever made.<br /><br />The filmmakers have crafted a movie that appeals to every horror fan. The story is engrossing and original. The villains are appropriately menacing and frightening. The sets are creepy and atmospheric. There is even a little blood and gore to satisfy the splatter fan of the house. But don't let the `horror' label scare you off, if you're not a fan of the genre. This film easily fits into many different categories.<br /><br />The screenwriter has deftly blended the drama, comedy, horror, kung fu, and romance genres into a delicious deluxe cinematic pizza. `A Chinese Ghost Story' is a beautiful epic love story told, thankfully, without the gratuitous nudity and/or explicit sex scenes that have ruined many Hollywood `love stories'. Those put off by the romantic elements of the story can sit back and revel in the fast-paced swordplay and `wire-fu'. If that's not enough, actors Leslie Cheung and Wu Ma provide enough humorous situations to satiate your appetite for comedy. This film offers something for every film fan.<br /><br />Director Siu-Tung Ching and Producer Tsui Hark assembled a truly amazing cast for this film. Leslie Cheung proves that he is not only a gifted actor, but also a talented singer and a charming physical comedian. I cannot possibly think of a performer other than Cheung who could have portrayed Ling Choi Sin better (except maybe Chow Yun Fat). Joey Wang is enchanting as Lit Su Seen, the enslaved spirit who steals the heart of Cheung's character. Her portrayal of the title character is truly haunting and memorable. Wu Ma is hilarious as the cantankerous Taoist who aids the young lovers.<br /><br />On technical level, this film is very impressive, even by today's standards. The direction is superb. I wish that today's Hollywood executives would seek out talented artists like Siu-Tung Ching rather falling back on the usual MTV video or Pepsi commercial `directors'. The cinematography is gorgeous. You have to commend any cinematographer who can make a film look good when most of its pivotal scenes take place in the dead of night. The special effects make-up is top-notch. In fact, most of the creature effects in this film blow away the shoddy CGI ghouls and goblins that have become commonplace in modern horror films.<br /><br />Since its release, \"A Chinese Ghost Story\" has spawned two worthy sequels, a full-length animated movie, and countless imitations. None of the films that followed it or copied it were able to capture the magic of this classic, however. This film is required viewing for any horror fan or just anyone looking for great way to spend 95 minutes of your time. 10 out 10.<br /><br />", "LBL": "positive"}
{"TEXT1": "For long time I haven't seen such a good fantasy movie, magic fights here are even better than in LOTR, even considering that it's a 1987 movie and haven't computer special effects. This movie have good plot, good acting and interesting ideas. Recommend everybody to see it.", "LBL": "positive"}
{"TEXT1": "Cannot believe a movie that can be made that good in 1987 and is virtually unknown in the west. Not to repeat other reviews here. The score is very good and moving. Literally it means \"Dawn please never comes\" - when it comes, the beautiful ghost and the lover will be apart forever. After 24 years, Joel and Leslie still look great. I enjoyed Joel in God of Gamblers and many movies by Leslie including Better Tomorrow.", "LBL": "positive"}
{"TEXT1": "\"Chinese Ghost Story\" is one of the most amazing Hong Kong films I have ever seen.It's a brilliant mix of fantasy,comedy,romance,horror and martial arts.The film has some wonderful visuals and amazing fights.I love especially the fight scene between Wu Ma and the tree demon tongue.Truly original and refreshing film and another Embalmer's fine recommendation.", "LBL": "positive"}
{"TEXT1": "Just read the original story which is written by Pu in 18th century. Strikingly, the movie despict the original spirit very well, though the plot was modified tremendously. The film language, the rhythm, the special effect are all from hollywood, but still there is a chinese core. It is amazing how Hark Tsui managed to combine them together. The result is pure beauty.", "LBL": "positive"}
{"TEXT1": "A mix of comedy, romance, music(?!), action and horror. A knockout. This is one of the reasons people rave about Hong Kong cinema. If you're looking for something totally original, look no further. Entertainment at it's peak.", "LBL": "positive"}
{"TEXT1": "There's never a dull moment in this movie. Wonderful visuals, good actors, and a classical story of the fight of good and evil. Mostly very funny, sometimes even scary. A true classic, a movie everybody should see.", "LBL": "positive"}
{"TEXT1": "If there is a movie to be called perfect then this is it. So bad it wasn't intended to be that way. But superb anyway... Go find it somewhere. Whatever you do... Do not miss it!!!", "LBL": "positive"}
{"TEXT1": "A Chinese Ghost Story stars the late, great Leslie Cheung as Ling Choi Sin, a penniless tax collector who decides to spend the night at a deserted temple, where he meets and falls for a beautiful woman called Tsing (Joey Wang). When Ling discovers that Tsing is actually a ghost who has been forced to seduce victims for an evil tree spirit who feeds on 'chi' (life force), he decides to try and free the girl by giving her remains a proper burial. Enlisting the help of Swordsman Yin (Wu ma), a crazy Taoist monk, Ling successfully defeats the tree spirit, but must also do battle in hell against the evil Lord Black, to whom Tsing is due to be wed.<br /><br />The first Hong Kong film that I saw which wasn't purely martial arts action, A Chinese Ghost Story opened my eyes to the incredible world of Asian fantasy horror, a magical realm inhabited by beautiful female ghosts, bumbling innocent heroes, sword wielding Taoist monks, monstrous spirits, and dark lords of the underworld; I instantly fell in love with the film's exuberance, energy, humour, inventiveness and visual excellence.<br /><br />Two decades later, and this amazing movie still remains one of the finest examples of its genre that I have seen\u0097a sumptuous, breathtaking masterpiece that brilliantly blends horror, comedy, fantasy and romance. With superb direction from Siu-Tung Ching, excellent editing from David Wu, stunning cinematography, and a whole slew of imaginative special effects (including a humongous killer tongue, a many tentacled monster, and multiple flying heads!), A Chinese Ghost Story is a completely unforgettable and thoroughly enjoyable experience from start to finish.", "LBL": "positive"}
{"TEXT1": "A true classic. Beautifully filmed and acted. Reveals an area of Paris which is alive and filled with comedy and tragedy. Although the area of 'Hotel du Nord' and the Hotel itself still exists, it is not as gay (in the original sense of the word) and joyful as it once must have been. The film makes one yearn for the past, which has been lost, with a sigh and bittersweetness.", "LBL": "positive"}
{"TEXT1": "this movie is the best movie ever it has a lot of live action It's just great everyone should watch it and the actor are great the location is Rome Italy thats the best place ever the actors are great Mary-Kate Olsen is such a great actress she plays Charlie and thats a great character and Ashley Olsen play Leila and thats a great character to love When in Rome love it.", "LBL": "positive"}
{"TEXT1": "wow...this has got to be the DUMBEST movie I've ever seen. We watched it in english class...and this movie made ABSOLUTELY no sense. I would never, EVER watch this movie again...and my sympathy to those who have ever PAID to see it.", "LBL": "negative"}
